#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-gzTdAMDChc3JKoxo

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-067b892a2faf55162]
aws_instance.composer_internal: Refreshing state... [id=i-09f1422c7fb304621]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2894777164]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-2123328067]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-1243d11f-144f-4088-a5ac-031c2d17c69c]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-46db2e27-653b-4606-90ac-ddad26e7ea48]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "3277100699" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWvxVYGrNutVjrvQ2FNtLGnPuj55HkuO/tzR1CeYxY9wlz/mGGWY5hGM4Rpnj0XOYJhThntsC0KrwXPtVrvdvlA9uhnenXpVpiWbGJOLfN0U9a42nBnDqfqsdNRO/1LmOmrvzyvLCzdHWZCWXT1zYWFQEkUw9phw7pCkfdXv6IaknMKldhTpeaZJ8nDxlFO4DuI1g/cUZzEkzC7Jwkv/fRO43lB7qmGKapfgMtdoX6VLXU0y9FfHJLU3mw5V49nUJk8+pWn+WKu99az66lkVRvCYxJdDrN32HV9T+cVClSYR+Xo78q8w2QT/cfmAhCQ77D17SQSDOAdP4F/gjmIY3ULm7t/AnV+41fIY36+fY/PlFrhqQBA8gbuvW40ggzJaTXHZZ12sOwv8w/b9ZXa8i3SUxAHN0NdD+S1Qym1wnt2KDJaYA6skA8MIrjEQSzU4A0EMOrZefeXqJSh/BFcMRCcdp3M+/ap5CSrKOfQk7rxW9WlEKq8Cuj5GIcBbnB2AwIIcoyT2cgBjD5BkDWgC8kNOkvVVZY4p8CCOkhgI7M1aSXym/Cy7U4YcQIRwnoNtAMuZE9AijjE5CcYYUB+D6Op5nhB8q6d0ywNpklHAP3B8adRlt/wrcgyg52WlcJIgSPwkpzf78Kzdi4L48aTis2EWzoLVAVAfUrDD32UYxAkFGNIgXpd8Z7NwlGQHkMSnryDOKYzRq33dgdQdX+49uC8v/qvqYHXlLfLy7H4Crcb/vzGsPNUGQAdEcH6zTH0cA7zHCNSKPKudXKq5QVxLk2OSuQl9hgRnN15IcV5k5xBmSUJPTw35Iac4AkEef0fBqiDkrb3ycCJdbD6xzDrGANRuLc9TiPCr4Q/sl4bTIHpj9y6gfhAD7q9w6YzGCzaCFdhhgGAMMgyRD5AXVz/PU5/vgDo1pO8jHx48HP/wCGwMdgEhAJIdPORgjSmAoM4KwMcZBi5GsEROsgKIBDimAOGM5m/DVB4nyHxMnpEXA3toDMCluL0z4jZyKxgQfAvQNIjXfyIYvyqyvAv1unC7lCU0QQk5J4GbjZxCWpR5rs4K744L5DkByamu5eAj6HbKgW4oD7sdQyohcslYmZ9HNQRrZ3+ZAqdlYgOf/pRTr7nwN53/Mjn+vxOpC3P/9dB1HHvgxJOXeLmKqb7Np9/lAMfbIEviMguCLcwC6BKcA5hhcE2O2DtB4/GV9Q+n028l1RpqU1WRVOMK5rkpmdKbCv1S4AK/K8e3bUctKFM9455TPXN1ibl0ERe5iqTrnb70dPc///Wf/w3ulak6NJ7LAds43c/Lgi5p1rArldnrsnLCNKTXz17HkK7vH5qkmxPj6f57uMtB/pKDHMceE+H8lAUY5mQ4U2QE3L96BZgrAeMm3gHc3V8Mu/vhIhUjPwH3Z9mVSlbEKPLOzx7IjxIPfNj/DsycSdkWy74vogw45zpECcBxeaqAYeJkdy4nv/JU+0ceXfdM7mNCzl3gL7263qCzrFoMLhKQBikub28lT4oM4a+/8VS+BX1M35QXMOxVK0NVNzpqV3oe9p7uv0dl4JlJfoLlY63GNdtVvlGvXv6tEUhxTmsRppDxIIW1qywm8H4odXTyHEdlfMoCGcMIVyuyOZm8dqtPd/cfv97AfmLuP94Y8+muFDfLgpiCpDgbHuPdjdzTmd/pmJ4q6aUYXbfLe3r/8Y3qT9WTSP0ShXcM1cr1V3nIOabMq6j7N2L+Hqd9Cc55qHDLAL2eOk2ANlDPwdDwOsgpzt7i4pS2S5rKu0tzurNvev+y5DHnJWYLSYHBv5f35boUeOD+428NTJ/Az2DzApgM3FX1E59OsyBe34Gfzt7dzkbPF8XPl9mousmTuHJl/zXKu98pDPwMThHPIsCsfq8Bla/Nb5f/nAEMAwua/J2A08MpSQ6gHH5Pmf48p+Rn0Fw2S8hcZxHQ7Zx6m2AVIEhxteLCHDfrgPEAA3788Udw//Hdk+4n8BO4/3g7ln66GWh+SU2ID6dx4Y2uvwSkX3k1+E1cnqNyeiJ4C8PPG3dfpzxj7DVCX4bizMCE+HAKxzvBKKP/R8HXON+A/Atv/n54PZXtMm9/BbVl3i/SG5LKt8CY9qZvu/kYY6/MkCiJtzgrK0Vw6vl6qg7K4peBXdmF7jAgsIiRX60gSE8Iv7uJ9KWB/3Qb/bJ+fLoDP/10a8LfKMTXQlukl7iCHGfbAOFLfGcZTstO9/0zxXc5yHCUUPye7XSR8wSFuByJfqHBuko7i7i8af3zfVgfH1os+0UwGeabyv8GAAD//6S7krOQHwAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Subscribing instance to RHN."
                
                # Register the instance with RHN.
                /usr/local/bin/aws secretsmanager get-secret-value \
              +   --endpoint-url ${SECRETS_MANAGER_ENDPOINT_URL} \
                  --secret-id ${SUBSCRIPTION_MANAGER_COMMAND_ARN} | jq -r ".SecretString" > /tmp/subscription_manager_command.json
                jq -r ".subscription_manager_command" /tmp/subscription_manager_command.json | bash
                rm -f /tmp/subscription_manager_command.json
                
                subscription-manager attach --auto
            EOT
            # (1 unchanged attribute hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Deploy keys for workers."
                
                # Deploy the composer CA certificate.
                base64 -d - <<< ${OSBUILD_CA_CERT} > ${COMPOSER_DIR}/ca-crt.pem
                
                # Deploy the composer key and certificate.
                /usr/local/bin/aws secretsmanager get-secret-value \
              +   --endpoint-url ${SECRETS_MANAGER_ENDPOINT_URL} \
                  --secret-id ${WORKER_SSL_KEYS_ARN} | jq -r ".SecretString" > /tmp/worker_keys.json
                jq -r ".worker_key" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-key.pem
                jq -r ".worker_crt" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-crt.pem
                rm -f /tmp/worker_keys.json
            EOT
            # (1 unchanged attribute hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "989742770" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWOrAlvlHqocdyGxp9pY0p51ffI8lhz9uaOpTzCLH+Euf8wxyjDNIxjDNc4ei5zBMKcM99gWhFaD59qtdrt9oXp0M7w7tapMSzYxJhf5uinqXW04M4ZT9VnpqJ3+pcp11N6fV5YXbo6yIC2beubCwqAkimDsMeHcIUn7qt/RDUk5RUvtKNLzTJPk4eIpp3AdxGsmiCnOYkiYXZKFl/b7Jm69ofZUwxTVLrFlrsG+Spe6mmTor45Jam82HarGs6lNnnxK0/yxVtumCDOsxwlcoy6wzUa97XLIY9rHfdY6NrbVt55XXz2vloxVGMFjEl8Ounbbm3zNri8WqjSJyNdbln+FySb4j8sHJCTZYe/ZSyIYxDl4Av8CdxTD6BZWd/8G7vzCrZZn/X79HMAvt8BVA4LgCdx93WoEGZTRaorLXuxi3VngH7bvL7PjXaSjJA5ohr4eym+BUm6D83xXZLAEJlglGRhGcI2BWKrBGQhi0LH16itXL0H5I7gCJTrpOJ3z6VfNS1BRzqoncee1qk8jUnkV0PUxCgHe4uwABBbkGCWxlwMYe4Aka0ATkB9ykqyvKnNMgQdxlMRAYG/WSuIz5WfZnTLkACKE8xxsA1jOpYAWcYzJSTDGgPoYRFfP84TgWz2lWx5Ik4wC/oHjS6Muu+VfkWMAPS8rhZMEQeInOb3Zh2ftXhTEjycVnw2zcBasDoD6kIId/i7DIE4owJAG8brkO5uFoyQ7gCQ+fQVxTmGMXu3rDqTu+JIcwH2ZHV5VB6srb5GXZ/cTaDX+/41h5ak2ADoggvObZerjGOA9RqBW5Fnt5FLNDeJamhyTzE3oMyQ4u/FCivMiO4cwSxJ6eo7IDznFEQjy+DsKVgUhb+2VhxPpYvOJZdYxBqB2a3meQoRfDX9gvzScBtEbu3cB9YMYcH+FS2c0XrARrMAOAwRjkGGIfIC8uPp55vp8B9SpIX0f+fDg4fiHR2BjsAsIAZDs4CEHa0wBBHVWAD7OMHAxgiVykhVAJMAxBQhnNH8bpvI4QeZj8oy8GNhDYwAuBfCdEbeRW8GA4FuApkG8/hPB+FWR5V2o14XbpSyhCUrIOQncbOQU0qLMc3VWeHdcIM8JSE7FLwcfQbdTDn1DedjtGFIJkUvGyvw8qiFYO/vLFDgtExv49Keces2Fv+n8l8nx/51IXZj7r4eu49gDJ568xMtVTPVtPv0uBzjeBlkSl1kQbGEWQJfgHMAMg2tyxN4JGo+vrH84nX4rqdZQm6qKpBpXMM9NyZTelPGXAhfvy/Ftb1ILylTPuOdUz1xdYi6txkWuIul6py893f3Pf/3nf4N7ZaoOjedyCDdO9/OyoEuaNexKZfa6rJwwDen1s9cxpOsbiSbp5sR4uv8e7nKQv+Qgx7HHRDg/ZQGGORnOFBkB969eAeZKwLiJdwB39xfD7n64SMXIT8D9WXalkhUxirzz0wjyo8QDH/a/AzNnUrbFsu+LKAPOuQ5RAnBcnipgmDjZncvJrzzn/pGH2T2T+5iQc6v4Sy+zN+gsqxaDiwSkQYrL21vJkyJD+OvvQJVvQR/TN+UFDHvVylDVjY7alZ6Hvaf771EZeGaSn2D5WKtxzXaVb9Srl39rBFKc01qEKWQ8SGHtKosJvB9KHZ08x1EZn7JAxjDC1YpsTiavLe3T3f3Hr3e5n5j7jzfGfLorxc2yIKYgKc6Gx3h3I/d05nc6pqdKeilG1+3ynt5/fKP6U/UkUr9E4R1DtXL9VR5yjinzKur+jZi/x2lfgnOePNwyQK+nThOgDdRzMDS8DnKKs7e4OKXtkqby7tKc7uybAaAsecx5idlCUmDw7+V9uS4FHrj/+FtT1SfwM9i8ACYDd1X9xKfTLIjXd+Cns3e3A9TzRfHzZYCqbvIkrlzZf43y7ncKAz+DU8SzCDCr32tA5WtD3uU/cADDwIImfyfg9HBKkgMoJ+RTpj/PKfkZNJfNEjLXWQR0O6feJlgFCFJcrbgwx806YDzAgB9//BHcf3z37PsJ/ATuP97Orp9uBppfUhPiw2lceKPrLwHpV54WfhOX56ic3hHewvDzxt3XKc8Ye43Ql6E4MzAhPpzC8U4wyuj/UfA1zjcg/8Kbvx9eT2W7zNtfQW2Z94v0hqTyLTCmvenbbj7G2CszJEriLc7KShGcer6eqoOy+GVgV3ahOwwILGLkVysI0hPC724ifWngP91Gv6wfn+7ATz/dmvA3CvG10BbpJa4gx9k2QPgS31mG07LTff9M8V0OMhwlFL9nO13kPEEhLkeiX2iwrtLOIi4PX/98H9bHhxbLfhFMhvmm8r8BAAD//5B24/20HwAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Subscribing instance to RHN."
                
                # Register the instance with RHN.
                /usr/local/bin/aws secretsmanager get-secret-value \
              +   --endpoint-url ${SECRETS_MANAGER_ENDPOINT_URL} \
                  --secret-id ${SUBSCRIPTION_MANAGER_COMMAND_ARN} | jq -r ".SecretString" > /tmp/subscription_manager_command.json
                jq -r ".subscription_manager_command" /tmp/subscription_manager_command.json | bash
                rm -f /tmp/subscription_manager_command.json
                
                subscription-manager attach --auto
            EOT
            # (1 unchanged attribute hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Deploy keys for workers."
                
                # Deploy the composer CA certificate.
                base64 -d - <<< ${OSBUILD_CA_CERT} > ${COMPOSER_DIR}/ca-crt.pem
                
                # Deploy the composer key and certificate.
                /usr/local/bin/aws secretsmanager get-secret-value \
              +   --endpoint-url ${SECRETS_MANAGER_ENDPOINT_URL} \
                  --secret-id ${WORKER_SSL_KEYS_ARN} | jq -r ".SecretString" > /tmp/worker_keys.json
                jq -r ".worker_key" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-key.pem
                jq -r ".worker_crt" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-crt.pem
                rm -f /tmp/worker_keys.json
            EOT
            # (1 unchanged attribute hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "9b091824090c20fc96ae8f1cdbb77093f716f5a306c8136a6a5b7c11dc0417c6" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "fc45d9aa76a0e88e3903faeba31d14762a369c9244c2980270bed571b4132fce" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ ami                          = "ami-07bb20d82c4e502f6" -> "ami-0a54ea24893e357ca" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-067b892a2faf55162" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-067b892a2faf55162" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R713LjSprmvSL6HTB1aqNn4gwlGJJVrO6aGIIAaCRkCiYTBGYnFDApwiRMAaABTp8X2Zu93cfbR9hIkNKRVOZ0985FjyIYEtL8+Zvvd0loURYtKdqR3VXkE5fvaZtUft3e5MmJRH/ignJfRH7dfX6nr3VVhggoc9N9d8WeRpjUTVIWnzjhmv/D1R+uRqOXi/5w9URbSZqqbJJ2WOu3rR/GOSnaP3GPCSWFn5PP75Iiaa/Dx92733bZtV80j6QeqUVYRkmx+8R9CJL2xYKB5Zac2puQlvtoFJbFY7L7w5We5OQr5n56uebqat+Quvl0xXEjjnHwiSOhOGKDVxzHcU0TP/j7Ni7rpCfRQ0a6YS37GXHvmiYe1Y3PzefzuSyB3l8IXSiq7FGZG3N5Pp8v5sbilD5q6zVdPi6KWRLSVZc7tSrXNhLp3bTNrKUtkOpDtLjvj0LqTp0iNuj9Vq/IfZ2AE9jS5cfQgbMbU6vkiO9n2hF0P2ePu3j2uO+AO56tf9b9KexsLO8mMSi106O5XU6SVRveWAYtAlVLbisrG9OkKseG18ptvpt/2WXWfKr0cbcLpvuJPktO9vo0duR0b+n8cmv0IK3IY5c4+5+btflzLKLayG7n8n6/do2gTunPWoxz/+5QHzobivsGtofCldM4uD928IPo3Kd+dRvdzGLb/3KvCketmyJNLLbh+H535HeJEUybJNDs/gOwycmRJsbs45fKgI7u3obVzqup5a9Wt56lx20PP+iRV8M7DW1LS5iTeTfexW0IaijbNJhYh/sPUt/zX2RTE8MFHEP+WE2Oxy/38eEoFm0gVfbdfRuRdvMznvDGfVEV286yCq8Se+0YElEItqfphyKe0SK+q71dSj6EpVHcz7XTTUilqWptul2yvw/l48+Z8NHdU1ffoi++3GbHzV1mpkqV2luRTPSNMC2VD81mFY5vnEnWPd4dIr3BcfRFWGxXS4xh1Ze7gJ9NsJvw5larCs+8EQjeLW7Mnx3cte6j+5GvHzEMo3kpLr3HYjPpXRNtN5uZ7mV+cTpJ6gcEk0zdgFmDUpHn++mi6/j14/qLHWwEefL44TGS/NCs78ZK6KJIW98IcgecqSakH0IvmS/h5hYE/Vbjbal9/HjiiWB8/szlflrW/16TKPbb67DM373GO4nEyUSYDZhfnDFPPWUtAFudsLH1vSykGh1XU82Wk9PKnh5hNt1+LNIb7wMp74Gh3uj88Xb8cXLLlcE+8pNXh10d66QlDywiXNyy8tv4E3fT5tXZvR9YjHg4+HUzcBaeo8An7i8XRqElo/Wd8rCAur62P3+UQv/xI8+TiTgRx8FYGD9+eJwEjxOf8JEUzgQx/DgTZuJl9wLq99BSzaftHx4nRJpG0Wz8UZjwj344DnhpKk3DaSTNguDDlIjkoxA9vj18/rBQTfvzncW3d5awMFG0sRNZMfEGWcjbGLyGzGGObxeZsLGQqWIVKIbjbT1ekyy0kT2eYqQAQxfdHmB5ibKJEIgeT3J9YiuZaC5jFIimHPGm6aDqLhCqjb/yUjvTTBMdbw2qyRHvfTExBkZGV4atYRNpUsSfEp2fVJ4WNaFQKWDrpYEDJGsZp3YmfDG20T1W8dTGpkeQoGIbbP0lgPa2kqNjxebGr+YybWvjjRnxuHCQ6SCsqaaq8VGud1aqxViKa3vJTwiupgYPZMRTydQ0z8rag5PRMsoBXAw8bxYIaaonRhpSNXVY68wU9mxkGjAKuXaw5loY6G4f3zlOBRCmBSlkEyIg68LmTs+jtanIJ3er9VG6u3XxJsWZLgKqT7wsPpkInXx0wo76UdKVjUlS3PtiVepSdbJXdIXSWELUPdyJYKM761OYypjgynb5k68LoYRx1RnHkgeKmbtS2dtbOg40MMUC9pAgF0ZG7/xlJMOV1oa0snRnlruO2ZEVtuxF2weZp1pOO9alsHZ77dbDeK/noNG1qFpQzDvKZmUKnmLSCNiidvAys3Y0rJgFvrNW0S1yoqW9MntLBb7jgDyikWNplQ+y8Tjio6NONd+x1xO3j4VgK3/R8fwWqV7jqPrYW2q+rQqxo9HEtGVgbU1HV8HaKmTJ5OnRLeg+wBQFi7Y3CywGinnAS6Ejq/JAtvE0VE0RZ8J9mGmbwKjGgdhIIcUtXuHMXGINCZuFLUayjlrBRYKFVzi2trIZ9JsskLzTbT8/mbnbG2jcYQTkiMey4WgQq8LS3EZrhKm6oJ6lq7OFQalmZqXk2Z6rS9nRW86a0JrdutSr3IxWkWjukTCvQSYsoBrJOsaZtY1MBwkLF2lLK40ooLue2HIWiMfb7+yVn/aa20gzkpmEkAcMJCwMxx1/269Ozxg1dpVsFpUIREotPpwEWnUXZuvOdgTfV7WTpVKdOKfYlqgT2qFk9nRh4w0yC3B0CsTrq7VkCqbk8mYZ5TvBROBgaVqyyE91ZMsuQDPX403RWYFFuJwtrdVG1NX23nJONhDwrb51j2DZHCxKC2cV1sGyQnilH+C2OgZpbOH81IYrdDB54d620S1yNiu0aKGfYj/scW7y3tZXx5JtrwXktBgqm9tgFVMr0xq0jdeGeFLQEo9RBoBraxOwnUt4OSmgIt9ZNOIJlg1oVDwSI2AUcwlgbHnORx4gNEZq1VnFvPdX9AC0zRjijWmKbUccYFnbKDeyWPSlGFi5tw9FXXKsmQgcKphp3BJVmC5SwLtZObnlq4mJNMFalSc3i4QQAfdW0m4RNlG0mJlB73ZRFm1dlE2Q4N25VB+7ONaNfgNBoaW+szmFKRp7qalamXFrFaCxrY9SuAKTMNUOYGvybrbZA5oJxlafLZJzTDbRRF2rQEPU3JgZVQxsaudYzt9+lSlYoDdE3EVLmvsOiKMlmi6S+W69kFV3a8ZwV+7Wi/n5o3k0LEAViOPpWtF3t4o81pPs9nl+IdvedlO5znFnF7h1c9y92n/+iLpSjqFdjt2+POp9RYFd5aCvMtCXPFSqzO3Lk96XgqeUvWuXRzctJ2B4rjLPrmLPLk8gLU/QrhLwij9QeeIkjla48yxZDpbRIcwp7y/56XoFStdeC4BGVbSMLcRrWpCDjmxl3ndm+7PM54+1BX3k4A4msmKnwiEUN4LvnLK7fNZ5x1f6iIMlzfytOXm5f/iok0O0kBee4x3CHE3XahUHyfyks49SdsAuO7iYd7qyPq3VCOD5Wz3JMJCMneF4vLdd72Ai37rOeKfbc/aZ6ima6ulup6fzXrfklY2NV3aInM0XzwE8TGQaOFoVqFrmrTY0lPRZIIEkcmjjLXEX8nLnOWbpbo29K87al3IgCSd+jtNoIRuRs2l8R99ZIp6sVbr38o/Tr2TWZMHNT5XbyXfeNtsZzqkIpA3TdwsTuQvF7+v8Be8W4tUdWuEkWNL0DrWU2OXuVlkfgbLbuTnlb42vMDV8bGeWRc5JCPvy9lvzl89RV6ocpFXmKVXKbAHtKgY2S4zlBCqloKclD9KSNREU2lWqpyWzWa+nP6IrU5AyuuVksG9a8p5S5Z5dSrpd9m5fim5aJcAue4Z5z2b0S8G1q9Szf8jvxGN8DXSqxLXLzu1LifmKnpYi268r5YnxfaHFfOs48P1jup2nlCLoS0lXqpTR9ZgO+iphY0CpcpfphcmRVrmulLyblqJul8KP6cq5aw/8iJ4y+CnTRQfZGWnZM/68QT+MvyphfLr24Oe8p/yQX0aL1+0q13uWXKtcT6uM8cnGgFJ2bspiA4sR5cS1K8rszOLJ79gtdntGo+yhzXiucrcfYpMIlEG/1E3Lsd4Pckiufbaplw56/hG//BCfeoaniup9efKYfc6YOzK+vbQU4FmvnW4PMUHw7PIIfoxfiWHT7Qe5jlBhtKvcTQecnS40JrrNbFvFDDcMZx7D8w/pylRXSvHiC2NPqWKgVBT05dg762bipQx/FXX7gZaoMzynTK4f6+EcwyvK+GZ6ZPb2zv7F+BuDS5wHSimAtBwzGUA66P9HdAfM6IMuyhPTh5dWsT6cM9iQZ7K7DDNsnK21yyPzpd+hO+iL6RMqDJ+DfJJ+9sEjsw9UyjHDsj7MDXjogVLF7o/txns289Gy01PmCwM2xlBhz8NZg64hwzWzKdML87u0PP2O3XI44JTFripxe4b7smcxiOF4wN2AjbOPDz7D8Mb84sd+nICz33cDL8rZfiAtj7pdxfoQ26qM+aKbDjn7yPxDV34vPsx7qAwxcsz8wGXxSjnXAFBhdhxwfBzwZpcCPOd/FqNi74d+PGfxLwHHb+cGcxsfA3FCg8KYrhVXALYurRe7I1HUo67MT69yirYTdIWKeidTsjJpMNQ8k/7rWkZ2gT2fRKm+M3KtZ/nREGf7UDI716H7aKVP10vQ+VuzckWt+U6+Uwy7WhroZJtf5bXf6L/IxUNutRzGl1l5OaVhWu6+TXsuAqWSzSEeV0vTrlTTrha6XakMc6ZSaSxvsHHDrhbwnJsWDD+A8WSXoplWmplWsm5Xivkj+beY95czJutkrbaUWPLGW+L9ua5ktdT827ZbtpQ4NIMp1WBmajBDE5hGKszcDmbGCWamDNO1ADNtMYyleAFTJMJ0LcJMH8M0XsB0LsHUlWBqjGHmLWG2kb+ja9XfbqDrCBQmsx/Xdi8+oYg739EamIIlTMMeZuysaAnTSIOpuYSpKsBU7WHqaTBTTzDzFsO6Ya3RwcxTYYbGMGX8ov68xjgufqDPoc7ScO86EYWJnA51rAPi4Ks68YLvJS38rRkHC9n2nWjvbk0hzFFzsQWru6pwGdMwF5gPfGULR0FHuHX7tYrH0RLvvSXOLntxKGqFZ38PYzKyNX2HRZysNUDDwqNhIsvR1iw9Z8Kfewp6CH4g6wtsy8HKpGE+YXtEz5IvtvoOdlQTor5KA1E4BhKgYTJ5bc/uuDPViQ0LwDM93uXgEGzlA7PnXT7r3QJXwdLYB9KmuFvIqk31qbuN+h+tu/RGL3X8ts7t/aXaAdvb+luzRBTIpjNJw4Iev9aDHMPB18qJznqhdMhj6VDbnGs4liNYHjw91ZEs7rJ6geXpoe6xh5rylX5cUZ/C5XrqpeoU9PMpENHUs+dTz1GnXo6mYLme6nY21dNs6inq1LXR1FPcqZurU13ZTb0lmkLbeF3fLzGF6Y7ht4P5Joa5l8JUzmG6m8B0zvwyg2l2PK/BOcw3GUzdMcxxDHPUwZStD9/0gzLLQROWO4Zej9WHLG8xmRRWKw21zJC/WZ0IzrXDxGP5Qik7j9Wj6VDfvJIfOvrUS40psPWp2xtT194NutBzd+o5aKr3TE40dUU0hezZVqdQQVNdCaduHw5jXjp/Lb8y52EaZzDXeZhrOcwNHqaqCHNjDNN1D1M5gzniYe6eYLoewzQUYbrrYaryMHXFYV9qnN7kkAmrPT1l6HtZ/dAP/a89PLO6k+X0FAw5u4rP+bsUWW/spuXRY71GXyXwTT2j22gKUncKbX0KmB4GGZlczO7GFPTrqSsymddTYIdToDCs7Kau7U7dQW9MfveN/bUU5loCU3cyxLA0m8B0k8McHWGuHmHq8jBdM1l7mO4EmKsdTNEJpmYO0/l4mM9V4a39gVIl+rlOPQ21MntOWe4f9CDp57sAXr/4AKvxmL4GXChDXcnqmtf4t8Op3s+nOpNPRFPdMaY6w/aS9czh1E3dqZergx505iuKMeAd9Aw32RTkDCPrN/bfiTCNUphqCcxNCtOQh6lGYa73MNWPMAUJzF3xnAfCDqbrDqYMM2sBpnIKU0qHva/tz/oY5sep3g/1kDDgwR58fgz6Krv0o8LQnzIfYHL3VTLU98MYq9lfy8983MvdKVgaU08xpkDRB9l05gc5mrrpeqrnbFwdbM/ihafMB3wAez317G/5P4hhGk7OmJ4fny6bjAyvLDTeGTy2sEqXFgIyVtEwd2dUwEJUJU6lGLzWWWIkRzxdGE60wZhuAiTIt8Ku1235i8ujk654CnDMTJdUHvNR4mwjFWF6a4kz33Ji0eUnMkJYX2Qb09hGSz/D2EabjcmrJ4ywHEmR7qYA+o65DVbAN3osuqKQRnxcuvwE+BmWbGxqBAnI2FKI1YzH4vDFwdTchrdsLuJfzlVygAQbbaONJ7zhw2kXZh47L78ocGh8S6i2tvKTb4px6am64O8YnmXJEyPNR4Ksq5GCJG2FeJrovGmaaCMjjGXDNjdGZkrGNio8Ht8ZzmxjZJppKuve5bVjqGHbwbh27LXo8tRcZILgppvaECp4J040uFQlvC0ln1YxKeadk4MkkECmq9Up4jelu60OPl9JqNf2Li8cIryWPGVeh7gyoIp5X8N5IGS3Lt14AWpB2LVfkLhZRA44AGpaTrYe63000bG81tVGBCJuI2Tw+kqbEnW21fv4iylsTiA1QeBgEVizCjt8j7cYeEY1dXlNu+u10lapjXO80IVsrC+jL37S9Cb23FD19iGOfS8b10YhHx17UwPb4IEzlsICQD1rOmvZHmwFf7G3mkFy7bjIYzXgsRMI3tbJzKMhyAuSe4fIWY+REPOGOMMmmjSWViUeOtWeA259fqZYWzC2Vi6vrzYacLRNKKHeR+AWKIgPivAWaDQhyD34K621V1VhIzAx1V1vqe0m0mihLzdJxFMPLwXo8VFxJ5kQ9EB2igjjJTU9XjtZNs49EaTIESgWND46Vp2+VXvDiYCRabIpVoWXxpInelLEm/Lw5VMqIwNr6zt+I1vbSDZVLTPyCOIsNoGKl56gYSdreMea8aDYHYMUHBY05kMbA8Crp1uRP0T5LIWrCCNMVUzXRz/baIEU2RbScFAYUrj0cltbdz6OOrg88Ziveh+dFnpubu766OSr0Qnh7NZGG4+onmpgsPD4iWNkGrCR3sFt5QXUO7pZZEbOurfySeFr6sHtZtmd6NVQ8zQ99crbHkCSyqIuzu7NbFbqqinbx2qgZWnq2Mi0HKp4YSBBMXJNjngsXXTQGJkmRTwoHETvIoEuDKphS9Ukcxs5T3KhbKOBVYQsRPGCZh3cmqnZ06lD4w3jy85phsVT72S6EOWg9RBYBdn46OAoC9RTaxde4qgb0e03DkGn9mu5xreeGJf+0ujtLfb0lPIuH04IrVxri7/5JeTbLwYNrGm2ujENZDKfXhioLXSjqiOepqTwNKswOuTgFKuGZInaWt+aKUHHsaOua6DOulsBjH1pfnRxvI2c6IvnnO5BRnFYrMemYtaGEPsGT13Qa4dF6glWAdJIjVJTM3uI2g6rE9fn2yNZ0ZOnYAU6NAtX5RHbsR30sX0nYYBwfB/k8crM1mPPQWMDA0jU5oCRx3tieWsuMSJqu3aRuTTFjYZwNYUY3EW90fli1QVISLCkVVZebaOuRRHaOIHTdCjHS7AF2JXAyRDco62Yx5BuHLjVJuGuinE28+1Fq3hCpaC8Kl1UWXgVlb4kZ0iqTig3zVCaS64DxnamrYOk5fGyle0VPblSJAepmVliyAeFKYYralgY4EWuH4IVBoFQjs0+E3Q17u1tdH8nUOSKdGOiyiQOXum9V0a9uXC7WYv4XWdmlYNy4JgrsMWZF3tpeMBL0zKXYOwnzW0oZieDaj2hWqujUxOowhE4kWTY/O3lS3LNzozv5MDy89svXSzr7uFWda2HuQk++3XxyT82nxoS1qRtcr/wd6T+tG9GxG/akfBpJkkfJqIw+zCbzS6rPpFTS+rCpw9hmVdlQ+rh9Z7RbqLyO/tynIVka2Gu7+01BA/6HMyXlzcD5kD5+09u9kET1knVJmUxumwZhWWe+0U0ygyXlrOn813LVvWHFbRsMNfVh3tT1dbbz03r75JiN3oSYfQkwlstKWvz8w1pw5uyCfYJjd4utNSFqdrWs2gqUO7hGtgPyLz7HLdt1Xy6uXkt2/WzbNd+7vdl4R+b67DMb57OvoNIceb2YvVwB5fWt0nSctf8iNDzWx/f4v2rgeu2zOm3Xwb5j6xMk/+8PPiUlkcSPURl7idFw33m/oN71xI/v75QvC7r3bt/5d7F++A6qMnx7fixrDNSfz3FPZ0Q+txn7t23uQ79UVi31xXJ3109cXcm+Dfz91/GxxtN52WRtHX4bVX+xOlsmju/ObevfQZf7rGsuXXu7wgns2NIzSUFN3es6+ddShk2n7gny+fDGYOdh79uojLc56RoB3Lnseu4zenVM4FFTMKMIwdSd5zEcw0JyyJqOL+IOFruuLbkmq6h5e7pyIa0XOSTvCw4iX8xxhafV/5Ge85UzvlhSJqGOyQ+1zQx1+6LgtCBMCFcGxMuf5K8KSl5eQ4TK+Kqsm458aMgMqYus+xn3xDOj6KaEadl6NO4bNoX8/759ChPik/DEb8xhkmdPHZcG/stdyR/rAlXlC1H/DYpdmzfmS2Sl3XHlcXwlBRN6xfhM3+Llbq4vYQQ7j2LIc9HJ49Pe/cNs92/cR8m/+MFY8yqEy7sQkqaF8NtTAqOnEjI3eyb+mYQ6SZIipuq7Ms6KNsHn5L6hRRq0ezrswrrsmyHFz2brmlJziVN8ceWe9xT+ppfbX2nXngettzP7RV385LzpvJD8sz4R/5rxtskf8X3MWnjpOCE/2KR3rrW3yjec96pSN0kDfO2i7QHv76hSfC9qP0PoIWzT148JHnkjoQL/YKriR/GXBgV17+90/dbJADQVv85j/0uIsW/fOIcwh0TSjmfHv2u4Xak5XxuzEtcTGrCBST0mf+Uj1xIE6abkNRt81qbDNRcHRP6EEYF56ztFTdXFFO1rDdMvNTco59Q8tJNq6TY/R3K+CFJFhHGY+nlUF22ZVjScyh8MdG0frtn0X7MS2/MxTUN5cqhUGi4X7jFfKGa9lpbL+a2ypB0idt13OQ3oX9zlne0JxUL79yvf5dQzxnhd4X/OkX807A08Jv42egWKSJu2NMwvDyRuX6dVf7YcKQ4JHVZsFzAHfw68QNKGs6vCfeUIkg0QOPT89a/Oan8pAK8NiHQVWA/gdlAKlJfVSdf9mRP3hQlL+u4m4QlvFFwTnijJ5FGl7LsQldXLWu+VD+/+7//+3/9H+69DsHaflCxCuzBPy8Dlmri9UJlMfwyMmDab58elbmtPr2Da6oWurM/v/9n/9hwzZeGa0gRjXLSDFFgNBoYH+1ryr1/loobPS0YBWXUce/eXxh79y8XqiSMS+79mfbVVb0vwjw6v3obxnkZcT+f/grMnJfyH3j+bSkx4s4hMWwpRwpmVW40KsrjOan+4N8F/pYX/0+jJiaUnsvq7735/wKdLHePyL7kqqQizHuvmnJfh+Tb7xlf/cQtSfsqyXJr5fpqDSx7Dhbqw1r5/P6fQ6b40V0zwPLTzY0wnV2Lk/H15fcN9VvStDc5af1R5Lf+zROtURL9Cztj3jQkZ/phZULh5+T6SkN3d8/l/+d373/5dkfw6+j9Ly+Y+fUdI3dfJ0XLlfsz4wU5vqA72PydRdqhnrjkrKdp5qfvf3l19K/XA0nrooU3G66vnv5iRm5IO3om9f4Vmf8e1r4o59ylBUxBz1ZvS85cgbMyTLJjWbt+jYshbLM1V2+cZvDZV60US3mj89Do4NM94f4n85enoSTi3v/yex3or9xfuPQLN6q5d9fWsM9q66TYveP+7Szdy2bz4XLww6XZvE6bsrh62v6jle/+SmLcX7hB43XOjR7/WgauvtUQX/5BiBuN/H1b/ncCjkIqWnYMNhnpzn0KK12SxyRkEeAMnvOil2Ukt5i/XHd9FfgNmY65UcSNuD//+c/c+1/e/HfBr9y/ce9/edns//qiu3tzynOR+jtnvHqt9ZsnXAj93jkZ6f4/fIAUUVUmRXvOZr/86KLi12+4zTfviX7XV17dBL12jpdT7763+oz+Z4X+QHdMOUx3L/zkG4f/o4D+SpWtB8uGJqtnbiJyuCkOOREK4cqy57Z6vmb6btPyJtnsq98w0rRl7e/Ib8llXz2NsYro+YLnKnnk/onb1aRiWHg681fupqpLVmvsi7b501DjXr3o0VTZ4pJmaMI6VqwWJGQ15GNSN0P9ycowe62rJpcU3C/89bXE87/+iYvKq6ceq2V12Avhn89gP0FN/Gz4+zE5/7cgJaTihCuOi8qCXF391iglj9xWs173h5xPa+JHHZf70dCzDzKeHpuHpHgsv3dsnj0216fH5tX81cDCcJ7uZ99oTJkghIuSmoQt6/pZ/580TVIMlyZ5FiU1N3qt2zO5eRSxnDeUdI9N6wdDOBsUznaeLfv+lxe8/PraQozViDz6e9o2HM/x77i/cC0h3Mh/QZTxwEi+FmpgwCQMjpZ6lxT707njOJ27wJowpJCwLLiReXhums/bGJZeaLsi9SBvWQxbw7g8sl3cw1tNffpq5BtKeXk3M1RDF8QmDXesk5aVuFcc15b7MH61++a6qstDwthIit1DyKDBBBliwO8ufEz+YeLBX1M9fcvbSX1IwqcMOI/SfdP+NtuWHB1uQZjn+1xRFqyhKiK/vlywDfpOGo4O12lJRmjHNgXk6ieuCf2iINGAzqouAxJdX/3E2VCBry8cCsIWna/7GIDqJDw315c7tIK0x7LOOEoOhLIurClzRn/IRf/KBfuWO7KGtPhjy8X+gXBJy9XJLm65ojxeXz170oDtM/iiy++vAuPIr5Lrpgwz0l5HN1fMK/72beWB1HUSkeuwLB5ZHhui855S7s9/5lSoXf2HNSz9z6u7QblWWxM///z6afbxw/SKLf6tUztfoI5qQks/OncTpGLN+Ft2/sgUmZct4c630s9WHmxx5rO5fkE595vsmcp5z78L15ddV9/pFZ/Wn4+6bLto4ff2fENxX3nSaPSHq/8XAAD//znHcMgDPwAA" -> "H4sIAAAAAAAA/9R72W7jSprmvYF6B3aeHFQ3TsvmIilTWZWNFkVSi80Ic4mgyJ6GwSUsLsElSWohT50XmZu5ncebRxgEJfvYzuVUFRqYagOCzVj++Jfv30L0oixaUrQju6vIJy7f0zap/Lq9yZMTif7EBeW+iPy6+/xOX+uqDBFQ5qb77oo9jTCpm6QsPnHCNf+Hqz9cjUYvF/3h6om2kjRV2STtsNZvWz+Mc1K0f+IeE0oKPyef3yVF0l6Hj7t3v+2ya79oHkk9UouwjJJi94n7ECTtiwUDyy05tTchLffRKCyLx2T3hys9yclXzP30cs3V1b4hdfPpiuNGHOPgE0dCccQGrziO45omfvD3bVzWSU+ih4x0w1r2M+LeNU08qhufm8/nc1kCvb8QulBU2aMyN+byfD5fzI3FKX3U1mu6fFwUsySkqy53alWubSTSu2mbWUtbINWHaHHfH4XUnTpFbND7rV6R+zoBJ7Cly4+hA2c3plbJEd/PtCPofs4ed/Hscd8Bdzxb/6z7U9jZWN5NYlBqp0dzu5wkqza8sQxaBKqW3FZWNqZJVY4Nr5XbfDf/ssus+VTp424XTPcTfZac7PVp7Mjp3tL55dboQVqRxy5x9j83a/PnWES1kd3O5f1+7RpBndKftRjn/t2hPnQ2FPcNbA+FK6dxcH/s4AfRuU/96ja6mcW2/+VeFY5aN0WaWGzD8f3uyO8SI5g2SaDZ/Qdgk5MjTYzZxy+VAR3dvQ2rnVdTy1+tbj1Lj9seftAjr4Z3GtqWljAn8268i9sQ1FC2aTCxDvcfpL7nv8imJoYLOIb8sZocj1/u48NRLNpAquy7+zYi7eZnPOGN+6Iqtp1lFV4l9toxJKIQbE/TD0U8o0V8V3u7lHwIS6O4n2unm5BKU9XadLtkfx/Kx58z4aO7p66+RV98uc2Om7vMTJUqtbcimegbYVoqH5rNKhzfOJOse7w7RHqD4+iLsNiulhjDqi93AT+bYDfhza1WFZ55IxC8W9yYPzu4a91H9yNfP2IYRvNSXHqPxWbSuybabjYz3cv84nSS1A8IJpm6AbMGpSLP99NF1/Hrx/UXO9gI8uTxw2Mk+aFZ342V0EWRtr4R5A44U01IP4ReMl/CzS0I+q3G21L7+PHEE8H4/JnL/bSs/70mUey312GZv3uNdxKJk4kwGzC/OGOeespaALY6YWPre1lINTquppotJ6eVPT3CbLr9WKQ33gdS3gNDvdH54+344+SWK4N95CevDrs61klLHlhEuLhl5bfxJ+6mzauzez+wGPFw8Otm4Cw8R4FP3F8ujEJLRus75WEBdX1tf/4ohf7jR54nE3EijoOxMH788DgJHic+4SMpnAli+HEmzMTL7gXU76Glmk/bPzxOiDSNotn4ozDhH/1wHPDSVJqG00iaBcGHKRHJRyF6fHv4/GGhmvbnO4tv7yxhYaJoYyeyYuINspC3MXgNmcMc3y4yYWMhU8UqUAzH23q8JlloI3s8xUgBhi66PcDyEmUTIRA9nuT6xFYy0VzGKBBNOeJN00HVXSBUG3/lpXammSY63hpUkyPe+2JiDIyMrgxbwybSpIg/JTo/qTwtakKhUsDWSwMHSNYyTu1M+GJso3us4qmNTY8gQcU22PpLAO1tJUfHis2NX81l2tbGGzPiceEg00FYU01V46Nc76xUi7EU1/aSnxBcTQ0eyIinkqlpnpW1ByejZZQDuBh43iwQ0lRPjDSkauqw1pkp7NnINGAUcu1gzbUw0N0+vnOcCiBMC1LIJkRA1oXNnZ5Ha1ORT+5W66N0d+viTYozXQRUn3hZfDIROvnohB31o6QrG5OkuPfFqtSl6mSv6AqlsYSoe7gTwUZ31qcwlTHBle3yJ18XQgnjqjOOJQ8UM3elsre3dBxoYIoF7CFBLoyM3vnLSIYrrQ1pZenOLHcdsyMrbNmLtg8yT7WcdqxLYe322q2H8V7PQaNrUbWgmHeUzcoUPMWkEbBF7eBlZu1oWDELfGetolvkREt7ZfaWCnzHAXlEI8fSKh9k43HER0edar5jryduHwvBVv6i4/ktUr3GUfWxt9R8WxViR6OJacvA2pqOroK1VciSydOjW9B9gCkKFm1vFlgMFPOAl0JHVuWBbONpqJoizoT7MNM2gVGNA7GRQopbvMKZucQaEjYLW4xkHbWCiwQLr3BsbWUz6DdZIHmn235+MnO3N9C4wwjIEY9lw9EgVoWluY3WCFN1QT1LV2cLg1LNzErJsz1Xl7Kjt5w1oTW7dalXuRmtItHcI2Feg0xYQDWSdYwzaxuZDhIWLtKWVhpRQHc9seUsEI+339krP+01t5FmJDMJIQ8YSFgYjjv+tl+dnjFq7CrZLCoRiJRafDgJtOouzNad7Qi+r2onS6U6cU6xLVEntEPJ7OnCxhtkFuDoFIjXV2vJFEzJ5c0yyneCicDB0rRkkZ/qyJZdgGaux5uiswKLcDlbWquNqKvtveWcbCDgW33rHsGyOViUFs4qrINlhfBKP8BtdQzS2ML5qQ1X6GDywr1to1vkbFZo0UI/xX7Y49zkva2vjiXbXgvIaTFUNrfBKqZWpjVoG68N8aSgJR6jDADX1iZgO5fwclJARb6zaMQTLBvQqHgkRsAo5hLA2PKcjzxAaIzUqrOKee+v6AFomzHEG9MU2444wLK2UW5ksehLMbBybx+KuuRYMxE4VDDTuCWqMF2kgHezcnLLVxMTaYK1Kk9uFgkhAu6tpN0ibKJoMTOD3u2iLNq6KJsgwbtzqT52cawb/QaCQkt9Z3MKUzT2UlO1MuPWKkBjWx+lcAUmYaodwNbk3WyzBzQTjK0+WyTnmGyiibpWgYaouTEzqhjY1M6xnL/9KlOwQG+IuIuWNPcdEEdLNF0k8916Iavu1ozhrtytF/PzR/NoWIAqEMfTtaLvbhV5rCfZ7fP8Qra97aZynePOLnDr5rh7tf/8EXWlHEO7HLt9edT7igK7ykFfZaAveahUmduXJ70vBU8pe9cuj25aTsDwXGWeXcWeXZ5AWp6gXSXgFX+g8sRJHK1w51myHCyjQ5hT3l/y0/UKlK69FgCNqmgZW4jXtCAHHdnKvO/M9meZzx9rC/rIwR1MZMVOhUMobgTfOWV3+azzjq/0EQdLmvlbc/Jy//BRJ4doIS88xzuEOZqu1SoOkvlJZx+l7IBddnAx73RlfVqrEcDzt3qSYSAZO8PxeG+73sFEvnWd8U635+wz1VM01dPdTk/nvW7JKxsbr+wQOZsvngN4mMg0cLQqULXMW21oKOmzQAJJ5NDGW+Iu5OXOc8zS3Rp7V5y1L+VAEk78HKfRQjYiZ9P4jr6zRDxZq3Tv5R+nX8msyYKbnyq3k++8bbYznFMRSBum7xYmcheK39f5C94txKs7tMJJsKTpHWopscvdrbI+AmW3c3PK3xpfYWr42M4si5yTEPbl7bfmL5+jrlQ5SKvMU6qU2QLaVQxslhjLCVRKQU9LHqQlayIotKtUT0tms15Pf0RXpiBldMvJYN+05D2lyj27lHS77N2+FN20SoBd9gzzns3ol4JrV6ln/5Dficf4GuhUiWuXnduXEvMVPS1Ftl9XyhPj+0KL+dZx4PvHdDtPKUXQl5KuVCmj6zEd9FXCxoBS5S7TC5MjrXJdKXk3LUXdLoUf05Vz1x74ET1l8FOmiw6yM9KyZ/x5g34Yf1XC+HTtwc95T/khv4wWr9tVrvcsuVa5nlYZ45ONAaXs3JTFBhYjyolrV5TZmcWT37Fb7PaMRtlDm/Fc5W4/xCYRKIN+qZuWY70f5JBc+2xTLx30/CN++SE+9QxPFdX78uQx+5wxd2R8e2kpwLNeO90eYoLg2eUR/Bi/EsOm2w9yHaHCaFe5mw44O11oTHSb2baKGW4YzjyG5x/SlamulOLFF8aeUsVAqSjoy7F31s3ESxn+Kur2Ay1RZ3hOmVw/1sM5hleU8c30yOztnf2L8TcGlzgPlFIAaTlmMoB00P+P6A6Y0QddlCemDy+tYn04Z7Ahz2R3GWbYOFtrl0fmS79Dd9AX0ydUGD4H+ST97INHZh+olGOGZX2YG/DQA6WK3R/bjfds5qNlp6fMFwZsjKHCnoezBl1DhmtmU6YX5ndpefodu+VwwCmLXVXi9gz3Zc9iEMPxgLsBG2cfH3yG4Y35xY/9OAFnv+8GXpSz/UBaHnW7ivUhtlUZ80U3HXL2kfmHrvxefJj3UBli5Jj5gcvilXKuAaDC7Djg+DjgzS4FeM7/LEbF3g/9eM7iXwKO384N5jY+BuKEBoUxXSuuAGxdWi92R6KoR12Zn17lFG0n6AoV9U6mZGXSYKh5Jv3XtYzsAns+iVJ9Z+Raz/KjIc72oWR2rkP30Uqfrpeg87dm5Ypa8518pxh2tTTQyTa/ymu/0X+Ri4fcajmML7PyckrDtNx9m/ZcBEolm0M8rpamXammXS10u1IZ5kyl0ljeYOOGXS3gOTctGH4A48kuRTOtNDOtZN2uFPNH8m8x7y9nTNbJWm0pseSNt8T7c13Jaqn5t223bClxaAZTqsHM1GCGJjCNVJi5HcyME8xMGaZrAWbaYhhL8QKmSITpWoSZPoZpvIDpXIKpK8HUGMPMW8JsI39H16q/3UDXEShMZj+u7V58QhF3vqM1MAVLmIY9zNhZ0RKmkQZTcwlTVYCp2sPU02CmnmDmLYZ1w1qjg5mnwgyNYcr4Rf15jXFc/ECfQ52l4d51IgoTOR3qWAfEwVd14gXfS1r4WzMOFrLtO9He3ZpCmKPmYgtWd1XhMqZhLjAf+MoWjoKOcOv2axWPoyXee0ucXfbiUNQKz/4exmRka/oOizhZa4CGhUfDRJajrVl6zoQ/9xT0EPxA1hfYloOVScN8wvaIniVfbPUd7KgmRH2VBqJwDCRAw2Ty2p7dcWeqExsWgGd6vMvBIdjKB2bPu3zWuwWugqWxD6RNcbeQVZvqU3cb9T9ad+mNXur4bZ3b+0u1A7a39bdmiSiQTWeShgU9fq0HOYaDr5UTnfVC6ZDH0qG2OddwLEewPHh6qiNZ3GX1AsvTQ91jDzXlK/24oj6Fy/XUS9Up6OdTIKKpZ8+nnqNOvRxNwXI91e1sqqfZ1FPUqWujqae4UzdXp7qym3pLNIW28bq+X2IK0x3DbwfzTQxzL4WpnMN0N4HpnPllBtPseF6Dc5hvMpi6Y5jjGOaogylbH77pB2WWgyYsdwy9HqsPWd5iMimsVhpqmSF/szoRnGuHicfyhVJ2HqtH06G+eSU/dPSplxpTYOtTtzemrr0bdKHn7tRz0FTvmZxo6opoCtmzrU6hgqa6Ek7dPhzGvHT+Wn5lzsM0zmCu8zDXcpgbPExVEebGGKbrHqZyBnPEw9w9wXQ9hmkownTXw1TlYeqKw77UOL3JIRNWe3rK0Pey+qEf+l97eGZ1J8vpKRhydhWf83cpst7YTcujx3qNvkrgm3pGt9EUpO4U2voUMD0MMjK5mN2NKejXU1dkMq+nwA6nQGFY2U1d2526g96Y/O4b+2spzLUEpu5kiGFpNoHpJoc5OsJcPcLU5WG6ZrL2MN0JMFc7mKITTM0cpvPxMJ+rwlv7A6VK9HOdehpqZfacstw/6EHSz3cBvH7xAVbjMX0NuFCGupLVNa/xb4dTvZ9PdSafiKa6Y0x1hu0l65nDqZu6Uy9XBz3ozFcUY8A76BlusinIGUbWb+y/E2EapTDVEpibFKYhD1ONwlzvYaofYQoSmLviOQ+EHUzXHUwZZtYCTOUUppQOe1/bn/UxzI9TvR/qIWHAgz34/Bj0VXbpR4WhP2U+wOTuq2So74cxVrO/lp/5uJe7U7A0pp5iTIGiD7LpzA9yNHXT9VTP2bg62J7FC0+ZD/gA9nrq2d/yfxDDNJycMT0/Pl02GRleWWi8M3hsYZUuLQRkrKJh7s6ogIWoSpxKMXits8RIjni6MJxogzHdBEiQb4Vdr9vyF5dHJ13xFOCYmS6pPOajxNlGKsL01hJnvuXEostPZISwvsg2prGNln6GsY02G5NXTxhhOZIi3U0B9B1zG6yAb/RYdEUhjfi4dPkJ8DMs2djUCBKQsaUQqxmPxeGLg6m5DW/ZXMS/nKvkAAk22kYbT3jDh9MuzDx2Xn5R4ND4llBtbeUn3xTj0lN1wd8xPMuSJ0aajwRZVyMFSdoK8TTRedM00UZGGMuGbW6MzJSMbVR4PL4znNnGyDTTVNa9y2vHUMO2g3Ht2GvR5am5yATBTTe1IVTwTpxocKlKeFtKPq1iUsw7JwdJIIFMV6tTxG9Kd1sdfL6SUK/tXV44RHgtecq8DnFlQBXzvobzQMhuXbrxAtSCsGu/IHGziBxwANS0nGw91vtoomN5rauNCETcRsjg9ZU2Jepsq/fxF1PYnEBqgsDBIrBmFXb4Hm8x8Ixq6vKadtdrpa1SG+d4oQvZWF9GX/yk6U3suaHq7UMc+142ro1CPjr2pga2wQNnLIUFgHrWdNayPdgK/mJvNYPk2nGRx2rAYycQvK2TmUdDkBck9w6Rsx4jIeYNcYZNNGksrUo8dKo9B9z6/EyxtmBsrVxeX2004GibUEK9j8AtUBAfFOEt0GhCkHvwV1prr6rCRmBiqrveUttNpNFCX26SiKceXgrQ46PiTjIh6IHsFBHGS2p6vHaybJx7IkiRI1AsaHx0rDp9q/aGEwEj02RTrAovjSVP9KSIN+Xhy6dURgbW1nf8Rra2kWyqWmbkEcRZbAIVLz1Bw07W8I4140GxOwYpOCxozIc2BoBXT7cif4jyWQpXEUaYqpiuj3620QIpsi2k4aAwpHDp5ba27nwcdXB54jFf9T46LfTc3Nz10clXoxPC2a2NNh5RPdXAYOHxE8fINGAjvYPbyguod3SzyIycdW/lk8LX1IPbzbI70auh5ml66pW3PYAklUVdnN2b2azUVVO2j9VAy9LUsZFpOVTxwkCCYuSaHPFYuuigMTJNinhQOIjeRQJdGFTDlqpJ5jZynuRC2UYDqwhZiOIFzTq4NVOzp1OHxhvGl53TDIun3sl0IcpB6yGwCrLx0cFRFqin1i68xFE3ottvHIJO7ddyjW89MS79pdHbW+zpKeVdPpwQWrnWFn/zS8i3XwwaWNNsdWMayGQ+vTBQW+hGVUc8TUnhaVZhdMjBKVYNyRK1tb41U4KOY0dd10CddbcCGPvS/OjieBs50RfPOd2DjOKwWI9NxawNIfYNnrqg1w6L1BOsAqSRGqWmZvYQtR1WJ67Pt0eyoidPwQp0aBauyiO2YzvoY/tOwgDh+D7I45WZrceeg8YGBpCozQEjj/fE8tZcYkTUdu0ic2mKGw3hagoxuIt6o/PFqguQkGBJq6y82kZdiyK0cQKn6VCOl2ALsCuBkyG4R1sxjyHdOHCrTcJdFeNs5tuLVvGESkF5VbqosvAqKn1JzpBUnVBumqE0l1wHjO1MWwdJy+NlK9srenKlSA5SM7PEkA8KUwxX1LAwwItcPwQrDAKhHJt9Juhq3Nvb6P5OoMgV6cZElUkcvNJ7r4x6c+F2sxbxu87MKgflwDFXYIszL/bS8ICXpmUuwdhPmttQzE4G1XpCtVZHpyZQhSNwIsmw+dvLl+SanRnfyYHl57dfuljW3cOt6loPcxN89uvik39sPjUkrEnb5H7h70j9ad+MiN+0I+HTTJI+TERh9mE2m11WfSKnltSFTx/CMq/KhtTD6z2j3UTld/blOAvJ1sJc39trCB70OZgvL28GzIHy95/c7IMmrJOqTcpidNkyCss894tolBkuLWdP57uWreoPK2jZYK6rD/emqq23n5vW3yXFbvQkwuhJhLdaUtbm5xvShjdlE+wTGr1daKkLU7WtZ9FUoNzDNbAfkHn3OW7bqvl0c/Natutn2a793O/Lwj8212GZ3zydfQeR4sztxerhDi6tb5Ok5a75EaHntz6+xftXA9dtmdNvvwzyH1mZJv95efApLY8keojK3E+KhvvM/Qf3riV+fn2heF3Wu3f/yr2L98F1UJPj2/FjWWek/nqKezoh9LnP3Ltvcx36o7BuryuSv7t64u5M8G/m77+Mjzeazssiaevw26r8idPZNHd+c25f+wy+3GNZc+vc3xFOZseQmksKbu5Y18+7lDJsPnFPls+HMwY7D3/dRGW4z0nRDuTOY9dxm9OrZwKLmIQZRw6k7jiJ5xoSlkXUcH4RcbTccW3JNV1Dy93TkQ1pucgneVlwEv9ijC0+r/yN9pypnPPDkDQNd0h8rmlirt0XBaEDYUK4NiZc/iR5U1Ly8hwmVsRVZd1y4kdBZExdZtnPviGcH0U1I07L0Kdx2bQv5v3z6VGeFJ+GI35jDJM6eey4NvZb7kj+WBOuKFuO+G1S7Ni+M1skL+uOK4vhKSma1i/CZ/4WK3Vxewkh3HsWQ56PTh6f9u4bZrt/4z5M/scLxphVJ1zYhZQ0L4bbmBQcOZGQu9k39c0g0k2QFDdV2Zd1ULYPPiX1CynUotnXZxXWZdkOL3o2XdOSnEua4o8t97in9DW/2vpOvfA8bLmf2yvu5iXnTeWH5Jnxj/zXjLdJ/orvY9LGScEJ/8UivXWtv1G857xTkbpJGuZtF2kPfn1Dk+B7UfsfQAtnn7x4SPLIHQkX+gVXEz+MuTAqrn97p++3SACgrf5zHvtdRIp/+cQ5hDsmlHI+Pfpdw+1Iy/ncmJe4mNSEC0joM/8pH7mQJkw3Ianb5rU2Gai5Oib0IYwKzlnbK26uKKZqWW+YeKm5Rz+h5KWbVkmx+zuU8UOSLCKMx9LLobpsy7Ck51D4YqJp/XbPov2Yl96Yi2saypVDodBwv3CL+UI17bW2XsxtlSHpErfruMlvQv/mLO9oTyoW3rlf/y6hnjPC7wr/dYr4p2Fp4Dfxs9EtUkTcsKdheHkic/06q/yx4UhxSOqyYLmAO/h14geUNJxfE+4pRZBogMan561/c1L5SQV4bUKgq8B+ArOBVKS+qk6+7MmevClKXtZxNwlLeKPgnPBGTyKNLmXZha6uWtZ8qX5+93//9//6P9x7HYK1/aBiFdiDf14GLNXE64XKYvhlZMC03z49KnNbfXoH11QtdGd/fv/P/rHhmi8N15AiGuWkGaLAaDQwPtrXlHv/LBU3elowCsqo4969vzD27l8uVEkYl9z7M+2rq3pfhHl0fvU2jPMy4n4+/RWYOS/lP/D821JixJ1DYthSjhTMqtxoVJTHc1L9wb8L/C0v/p9GTUwoPZfV33vz/wU6We4ekX3JVUlFmPdeNeW+Dsm33zO++olbkvZVkuXWyvXVGlj2HCzUh7Xy+f0/h0zxo7tmgOWnmxthOrsWJ+Pry+8b6rekaW9y0vqjyG/9mydaoyT6F3bGvGlIzvTDyoTCz8n1lYbu7p7L/8/v3v/y7Y7g19H7X14w8+s7Ru6+ToqWK/dnxgtyfEF3sPk7i7RDPXHJWU/TzE/f//Lq6F+vB5LWRQtvNlxfPf3FjNyQdvRM6v0rMv89rH1RzrlLC5iCnq3elpy5AmdlmGTHsnb9GhdD2GZrrt44zeCzr1oplvJG56HRwad7wv1P5i8jUkRVmRTt2ZN/+VGT9utly4VKErH1v9O0/sr9hUu/cKOae3dtDfustk6K3Tvu384KedmfPlx4fbj0p9dpUxZXT9t/tPLdX0mM+ws3GKnOudHjX8vA1bd66Mv/FHGjkb9vy/9OWFNIRcuOIS0j3bm1YdVO8piELGic8XZe9LLy5Bbzl+uurwK/IdMxN4q4EffnP/+Ze//Lm39I+JX7N+79Ly/vB3590RC+OeW5rv2dM169CfvNEy6Efu+cjHT//9zmm1dLv+srry6PXjvHy6l331t9Rv+zQn+gO6YcprsXfvKNw/9RQH+lytaDZUOTlUA3ETncFIecCIVwZdlzWz3fTH23z3mTn/bVbxhp2rL2d+S3fLSvnsZYEfV8J3SVPHL/xO1qUjEsPJ35K3dT1SUrT/ZF2/xpKIuvXrR1qmxxSTP0bR2rbwsSsrLzMamboWRllZu91lWTSwruF/76WuL5X//EReXVU1vWstLthfDPZ7CfoCZ+Nvz9mJz/wZASUnHCFcdFZUGurn7rrZJHbqtZr1tKzqc18aOOy/1oaPMHGU+PzUNSPJbfOzbPHpvr02Pzav5qYGE4T/ezb/SyTBDCRUlNwrasu+HKIGmapBjuWfIsSmpu9Fq3Z3LzKGJpcqgCH5vWD4ZwNiic7Txb9v0vL3j59bWFGKsRefT3tG04nuPfcX/hWkK4kf+CKOOBkXwt1MCASRgcLfUuKfanc5NyOjeONWFIIWFZcCPz8Nxnn7cxLL3QdkXqQd6yGLaGcXlku7iHt5r69NXIN5Ty8jpnKKAuiE0a7lgnLauKrziuLfdh/Gr3zXVVl4eEsZEUu4eQQYMJMsSA3134mPzDxIO/puD6lreT+pCETxlwHqX7pv1tti05OlycMM/3uaIsWA9WRH59uZMb9J00HB1u4JKM0I5tCsjVT1wT+kVBogGdVV0GJLq++omzoQJf31EUhC063xAyANVJeO7HL9duBWmPZZ1xlBwIZY1bU+aM/pCL/pUL9i13ZD1s8ceWi/0D4ZKWq5Nd3HJFeby+evakAdtn8EWX318FxpFfJddNGWakvY5urphX/O3bygOp6yQi12FZPLI8NkTnPaXcn//MqVC7+g9rWPqfV3eDcq22Jn7++fXT7OOH6RVb/Ftzd75zHdWEln50bkBIxfr3t+z8kSkyL1vCnS+yn6082OLMZ3P9gnLuN9kzlfOefxeuL7uuvtNePq0/H3XZdtHC7+35huK+8qTR6A9X/y8AAP//QRSLxzY/AAA=" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-07868b244d83e155b" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-07bb20d82c4e502f6" -> "ami-0a54ea24893e357ca" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-09f1422c7fb304621" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-09f1422c7fb304621" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R72XLbzL3nPavyDjj6PJVz6juUsJC06cSpQxAAFxENYWsQyKRUWFrE0kDDALgAX/wiczO383jzCFMNUrIk23KSOReJq1gyevn3f/n9tyY4J0WDimZotSX6yOR73CSlXzU3eXJC0R+YgOyLyK/aT1fqSpVFzQbSzHCvBvRpCFFVJ6T4yHDX7O8GvxsMh88X/W7wSFtK6pLUSdOv9ZvGD+McFc0fmIcEo8LP0aerpEia6/Bhd/V1l1X5Rf2AqqFchCRKit1H5n2QNM8W9Cw36NTchJjso2FIiodk97uBmuToG+Z+eb5mMNjXqKo/DhhmyFAOPjIo5Id0cMAwDFPX8b2/b2JSJR2K7jPU9mvpvyFzVdfxsKp9ZjabzUQBdP6ca0Nepo/STJ+Js9lsPtPnp/RBWa3w4mFeTJMQL9vcqWSxsmwebyZNZi4sDpXvo/ldd+RSd+IUsY7vtmqJ7qoEnMAWLz6Ejja9MZRSjNhuqhxB+2v2sIunD/sWuKPp6lfVn2itBcXdOAZEOT0Y28U4WTbhjanjIpCV5LY0sxFOSjLSvUZs8t3s8y4zZxOpi9tdMNmP1WlyslankSOme1NlF1u9A2mJHtrE2f9ar4xfY96u9Ox2Ju73K1cPqhT/qsQw9zeH6tBaGr+vteZQuGIaB3fHVnvPO3epX95GN9PY8j/fydxRaSe2whfbcHS3O7K7RA8mdRIoVvceWOjkCGN9+uFzqWuO6t6G5c6rsOkvl7eeqcZNp71XI6/SNoq9JSY3Q7N2tIubEFSaaOFgbB7u3gtdx34WDYUP59pIY4/l+Hj8fBcfjnzRBEJpbe6aCDXrX+GY1e+Ksti2pll4Jd8pxxDxXLA9Td4X8RQX8abydil6HxK9uJspp5sQCxPZXLe7ZH8XisdfM+6Du8euurU/+2KTHdebzEilMrW2PBqra25CpPf1ehmObpxx1j5sDpFawzj6zM23ywWEWtmRXcBOx9BNWGOrlIVn3HAI7uY3xq8ObBv3wf3AVg9QC6MZ4RfeQ7Eed65hb9frqeplfnE6CfJ7W0syeQ2mtZ3yLNtN5m3Lrh5Wn61gzYnjh/cPkeCHRrUZSaFrR8rqhhNb4EwULn0feslsoa1vQdBtFdYSmocPJxZx+qdPTO6npPqvCkWx31yHJL96iXcU8eMxN+0xPz9jHnvSigOWPKZjqzuRSxU8KieKJSanpTU5atlk+6FIb7z3iNwBXb5R2ePt6MP4liHBPvKTF4cNjlXSoHsaES5uWfpN/JG5afLy7N73NEbcH/yq7jkLz1HgI/PXC6OaKdqrjXQ/11R1ZX36IIT+wweWRWN+zI+CETd6eP8wDh7GPmIjIZxyfPhhyk35y+65pt5ppmw8bn//MEbCJIqmow/cmH3ww1HAChNhEk4iYRoE7yeIRx+46OH14bP7uWxYnzYm22xMbm7Y0dpKRMmAa9u0vbXOKrbRz7HNPOPWpm3IUAaS7nhbj1UE016LHouhLQFd5d0OQHFhZ2Mu4D0W5erYkjLeWMR2wBtixBqGY5ebgCvX/tJLrUwxDPt4q2NFjFjvswEh0DO81C0FGrYiROwpUdlx6SlRHXKlBLZeGjhAMBdxamXcZ30b3UEZTixoeMjmZGiBrb8AmrUtxehY0rnRi7lM2VpwbUQsLBzbcGyoyIassFGutmaqxFCIK2vBjhEsJzoLRJvFgqEonpk1ByfDJMqBNu95Xs9tW5E9PlJsWZH7tc5Uos96pgC9ECsHKq4Jgep28cZxSmBDXKBCNDQbiCq33qh5tDIk8eRulS5Kd7cuXKcwU3mA1bGXxSfDtk++fYKO/EFQpbWBUtj5fElUoTxZS7y001iwsXvY8GCtOqtTmIoQwdJy2ZOvcqEAYdnqR8ICychdgXTWFo8CBUwgBz2bEws9wxt/EYnaUmlCXJqqM81dx2jREprWvOmCzJNNpxmpQli5nXLrQbhXc1CrSlTOMWQdab00OE8ycAQsXjl4mVE5CpSMAm7MZXRrO9HCWhqdKQPfcUAe4cgxldIH2WgUsdFRxYrvWKux28VcsBU/q3B2a8te7cjqyFsoviVzsaPgxLBEYG4NR5XByixEwWDx0S3wPoDYDuZNZxSQDyTjABdci5bkgLbxJJQNHmbcXZgp60AvRwFfCyGGDVzCzFhAxebWc4uPRNVuONfmTLiEsbkVjaBbZ4HgnW672cnI3U63Ry20gRixUNQdRYMytzC20cqGWJ5jz1Tl6VzHWDEyIniW56pCdvQW0zo0p7cu9ko3w2XEG3ubm1Ug4+aaHIkqhJm5jQzH5uaurSzMNMIA7zpkiVnAH29/sFd83GtsI0VPpoJte0C3ubnuuKPv+9XpCaP6rhSNouQBj7HJhuNAKTdhtmoth/N9WTmZMlaRc4otATuhFQpGh+cWXNtGAY5OYbPqciUYnCG4rEGifMcZNjiYipLM81MVWaIL7KnrsQbvLME8XEwX5nLNq3JzZzonC3DwVt26R7CoDybGhbMMq2BR2nCpHrRteQzS2IT5qQmX9sFguTvLsm9tZ720543mp9APO5gbrLf15ZFgWSvOdhqoSevbYBljM1NqexuvdP4k2Qs4sjMAXEsZg+1MgItxoUnixsQRi6Coa3rJ2nwE9GImAAhNz/nAAtse2XLZmsWs85f4AJT1SINrw+CbFjnANLdRrmcx7wsxMHNvH/Kq4JhTHjiYM9K4QTI3maeAdTMyvmXLsWErnLkkJzeLuNAG7q2g3NrQsKP51Ag6t42yaOva2djmvI2L1ZELY1Xv1hoolNR31qcwtUdeashmpt+aBagt84MQLsE4TJUD2Bqsm633AGecvlWn8+Qckw17LK9koNjYWBsZlnRoKOdYzt5+kylooNd52EYLnPsOiKOFPZkns91qLsru1oi1Hdmt5rPzR/FwWIAy4EeTlaTubiVxpCbZ7dP8XLS87bp0nePOKmDj5rB9sf/84VWJjDSLjNyOHNWuxMAqc9CVGegIq0ll5nbkpHaE8yTSuRY5uikZg/65zDyrjD2LnEBKTppVJuAFf6D0+HEcLWHrmaIYLKJDmGPWX7CT1RIQ11pxAEdltIhNm1WUIAct2oqs70z3Z5nPH3MLusiBrZaIkpVyh5Bfc75zyjb5tPWOL/QRBwuc+Vtj/Hx//5HHh2guzj3HO4S5PVnJZRwks5NKPxJpgUVabT5rVWl1WskRgLPXehK1QNB3uuOx3na10xLx1nVGO9Wa0c9ETe2Jmu52ajrrVFNcWlB/YYfIWX/2HMBqiYgDRykDWcm85RqHgjoNBJBEDq69BWxDVmw9xyDuVt+7/LR5LoctwMTPYRrNRT1y1rXvqDuTh+OVjPde/mHyjcyKyLn5qXRbceNts53unIpAWFN9N1oitiH/Y50/4920WXlnL2ESLHC6sRuMLLK7lVZHIO12bo7ZW/0bTPUfy5lmkXPiwo7cfm/+8jmqUpmDtMw8qUypLTSrjIFFEyMZaxLh1JSwICW0icCaVaZqSqjNOjV9i66IQUrpknFv35SwnlTmnkUE1SKd2xHeTcsEWKSjmPcsSp9wrlWmnvUmv2OP8tXTKRPXIq3bEYH6ipoSnu5XJXKifF9oUd869ny/Tbf1JMKDjgiqVKaUrkd10JUJHQNSmbtUL1SOtMxVibBuSnjVItzbdMXctXp+eE/q/ZTqotXoGSnpKH9erx/KX5lQPl2r93PWk97kl9JiVavM1Y4m1zJX0zKjfNIxIJHWTWlsoDGCjF2rxNTONJ78xG6x21EapNMsynOZu10fm3gg9frFbkpGatfLIbjW2aZe2uv5LX7ZPj51FE8lVjty8qh9zpg7Ur69lHDaWa+tavUxgfMscgRv41eg2HS7Xq6jJlHaZe6mPc5OFxpj1aK2LWOKG4ozj+L5TboiViXCX3xh5EllDKQSg46MvLNuxl5K8Vdit+tp8SrFc0rlelsP5xheYso31SO1t3f2L8rfCFziPJAIB1IyojKAtNf/W3R7zKi9LsiJ6sNLy1jtz+ltyFLZXYoZOk7XWuRIfekndHt9UX1qEsVnL5+gnn3wSO2jSWREsaz2cz0eOiCVsfu23VjPoj5KWjWlvtBjY6RJ9Lk/q9e1RnFNbUr1Qv0uJaef2C3XepzS2FUmbkdxTzoagyiOe9z12Dj7eO8zFG/UL9724wSc/b7teZHO9gMpOapWGat9bCsz6otu2ufsI/UPVfpZfJh1mtTHyBH1A5fGK+lcA2gStWOP42OPN4tw2jn/0xgVe2/68YzGvwQcv58bjG18DPgxDgp9spJcDliqsJrvjkiSj6o0O73IKcqOUyXMq62I0dLAQV/zjLtvaxnRBdZsHKXqTs+VjuZHnZ/uQ8FoXQfvo6U6WS1A62+N0uWV+gf5TtKtcqHbJ8v4Jq99pf8sF/e51XQoX0bp5RiHKdl9n/aMB1IpGn08LheGVcqGVc5Vq5Qp5gypVGjeoOO6Vc61c26aU/wAypNFeCMtFSMtRdUqJeMt+beQ9RdTKut4JTcYmeLaW8D9ua6ktdTs+7ZbNBg5ONNSrGiZoWiZPdbSSNYyt9Uy/aRlhqilK07LlHk/lsK5ltq8lq54LVNHWhrPtXQmaKkraKk+0jJvoWVr8Qe6lv3tWnMdDmvJ9O3a7tkn5GHrO0qtpWChpWGnZfSsaKGlkaKlxkJLZU5L5U5LPUXL5JOWefN+Xb9Wb7XMk7XMHmkp5dfuzmv04/wNffZ1lgI714mwlohpX8c6IA6+qRMv+F7gwt8acTAXLd+J9u7W4MLcri+2oHVXGS5iHOYc9YFvbOFI9lHbut1KhqNoAffeAmaXvTDklcKzfoQx0bYUdQd5mKwUgMPCw2EiitHWIJ4zZs89BT4Eb8j6DNtisDRwmI/pHt4zxYutfoAd2dDsrkwDnjsGAsBhMn5pz/a4M+SxpRWApXrc5OAQbMUDtecmn3ZuActgoe8DYV1s5qJsYXXibqPurXWX3ui5jl/XuZ2/kFtgeVt/axAbA9FwxmlY4OO3ehBjrfc1MlZpL5T2eSzta5tzDUdzBM2Dp8c6ksZdWi/QPN3XPVZfU77Qj8urE22xmnipPAHdbAJ4e+JZs4nnyBMvtydgsZqoVjZR02ziSfLEteyJJ7kTN5cnqrSbeAt7oln6y/p+AbGW7ih+Wy1fx1rupVoq5lq6G2vpjPplpqXZ8bwG5lq+zrTUHWk5jLXcbrWUrg9f9YMizUFjmjv6Xo/WhzRvUZkkWiv1tUyfv2mdCM61w9ij+UIirUfr0bSvb17IrznqxEv1CbDUidvpE9fa9bpQc3fiOfZE7aic9sTl7YlGny15okn2RJXCiduF/ZiXzl7KL81YLY0zLVdZLVdyLddZLZV5LddHWrrqtFTMtNxmtdw9aelqpKUhr6W7TktlVktdvt+X6qdXOWRMa09P6vteWj90ff9r9c+07qQ5PQV9zi7jc/4mPO2N3ZQcPdprdGWivapnVMuegNSdaJY6AVQPvYxULmp3fQK61cTlqcyrCbDCCZAoVnYT13Inbq83Kr/7yv5KquVKoqXuuI9haTbW0nWu5fZRy+Wjlrqslq6orJ2W7jgtl1sttU9aauRaOhv187nMvbY/kMpEPdepp75Wps8pzf29HgT1fBfAqhcfoDUe1VePC6mvK2ld8xL/VjhRu9lEpfLx9kR19IlKsb2gPXM4cVN34uVyrweV+oqk93gHHcVNNgE5xcjqlf13vJZGqZYqiZYbWEtDVksVrOVqp6XqUUtBouUuf84DYaulq1ZLKWZWnJaKqZZi3O99aX/ax1A/TtWur4e4Hg9W7/Mj0JXZpR/l+v6U+gCVuyuTvr7vx2jN/lJ+6uNe7k7AQp94kj4BktrLplI/yO2Jm64mak7H5d72NF540qzHB7BWE8/6nv+DWEvD8RnTs+PjZZOewaVpj3Y6C00o44VpAxHKdj+30Utg2lhGTinprNKafCRGLJ7rTrSGEK8DmxNvuV2nWuJnl7VPquRJwDEyVZBZyEaJs41kG+Jbk5/6phPzLjsWbRuq82xt6Nto4WcQWvZ6bbDyCdpQjIRIdVOg+Y6xDZbA1zvIuzyXRmxMXHYM/AwKFjQUZHO2vsUalDMW8v0XBxNjG97SuYh9PleKgc1Z9jZae9wrPpxmbuSx8/yLAgfHtwgrKzM/+QYfE09WOX9H8SwKHh8pvs2JqhxJtqAsbRYnKmsYhr0WbQhF3TLWemYI+jYqPBZudGe61jPFMKRV57LKMVSg5UBYOdaKd1lszDOOc9N1pXOltuHHiraQBbglgo/LGBWz1slBEgggU+XyFLFr4m7Lg8+Wgt0pe5flDhFcCZ40q0JY6poMWV+BecBlty5ee4HdgLBtPtv8eh454ACwYTrZaqR20ViF4kqVax7wsIlsnVWXygTJ063axZ8Nbn0CqQECB/LAnJbQYTu4hcDTy4nLKsqmU4glYwvmcK5y2UhdRJ/9pO4M6Lmh7O1DGPteNqr0Qjw61roCls4CZySEBdDUrG7NRXOwJPjZ2io6ypXjPI/lgIVOwHlbJzOOOifOUe4dImc1srmY1fkpNOxxbSpl4tmnynPArc9OJXMLRubSZdXlWgGOsg4Fu/NtcAskmw2K8BYoOEG2e/CXSmMty8KywdiQd50pN+tIwYW6WCcRiz244DSPjYqNYGigA6JTRBAusOGxysm0YO7xILUdDkNOYaNj2apbudOdCOiZIhp8WXhpLHi8J0SsIfZfPqWirUNltWHXormNRENWMj2PNJjFBpDhwuMU6GQ165hTFhS7Y5CCwxzHbGhBAFj5dMuzhyifptoygjbEMsSro5+tlUCILNNWYFDoQrjwcktZtT6MWm1xYiFbdr59mqu5sd500cmXo5MNs1vLXntI9mQdgrnHjh09U4Blq622Lb0Ae0c3i4zIWXVmPi58RT647TTb8F6lKZ6iph657YCGUpFX+emdkU2JKhuidSx7WqYij/RMyTUZznWbk/RcESMWChcd1HqmCBELCsfGm4jDcx0r0JQVwdhGzqNcdrZWwDKyTRvDOc5abWukRocnDo7XlC8rxxnkT52TqVyUg8azwTLIRkcHRlkgnxqr8BJHXvNut3aQfWq+lWt06/Ex8Rd6Z22hp6aYddlwjHDpmlv43S8hX38xqENFseS1odsG9em5bjeFqpdVxOIUFZ5iFnprOzCFsi6YvLJSt0aK7OPIkVcVkKftLQdGvjA7ujDeRk702XNOdyDDMCxWI0MyKp2LfZ3FLuiUwzz1OLMAaSRHqaEYnWY3LZTHrs82R7TEJ0+CkubgLFySI7RiK+hiayNAYMP4LsjjpZGtRp5jj3QINCTXB2h7rMeTW2MBbSQ3K9c2Fga/VmxYTjQINlGntz5ftoHNJVBQSjMvt1Hb2JG9dgKnbu0cLsAWQFcAJ51zj5ZkHEO8drStMg53ZQyzqW/NG8njSsnOS+LapQmXEfEFMbOF8mTnhhEKM8F1wMjKlFWQNCxcNKK1xCdXiMQgNTKTD9mgMPhwiXUTAjjP1UOwhCDgyMjoMk6V487aRncbDtsuj9eGXRrIgUu180jUGXO3nTY2u2uNrHTsHDjGEmxh5sVeGh7gwjCNBRj5SX0b8tlJx0qHsNKo9qkOZO4InEjQLfb28iW5YmX6D3Ig+fT6SxfT3Nzfyq55PzPAJ78qPvrH+mONwgo1de4X/g5VH/f1EPl1M+Q+TgXh/Zjnpu+n0+ll1cekaFBV+Pg+JHlJalT1r/cMa3KoRtnlONMWzbmxurNWGrhXZ2C2uLwZMAPSP35yvQ/qsErKJiHF8LJlGJI894tomOkuJtPH813TktX7pWZaYKbK93eGrKy2n+rG3yXFbvgowvBRhNdaklbGpxvUhDekDvYJjl4vNOW5IVvmk2gykO60FbDubWPzKW6asv54c3MoQzRkI07gxiOBnYxH04ALo+G0O1Xvu/Hh+qXs10+yX9ON137ud6Twj/V1SPKbRwY3mi05M2u+vN9oC/OtcznEClzgj1lB8AM2HA/R58OOnA78NSa7+qenPb0/8j0tfDNw3ZAcf/+1kj9nJE3+cnnwMSZHFN1HJPeTomY+MX9mrhrk59cXitek2l39J3MV74ProELH1+NHUmWo+naKeTwh9JlPzNX3uQ79YVg11yXKrwaP3J0J/t38/bfx8UrTOSmSpgq/r8pfGJVOM+d38PaVTx2BeSAVs8r9HWJEegyqmKRgZo55/bRLImH9kXmER96f0du5/99NRMJ9joqmJ3ceu46bHA+eCMxjFGYMOqCqZQSWqVFIiqhm/CJiMNkxDWHqtsZk93hkjRom8lFOCkZgn43RxeeVX2nPqMoZPwxRXTOHxGfqOmaafVEg3BNGiGlixOSPktcEo+fnULEipiRVw/AfOJ4ydZml//Y1YvwoqihxTEIfx6Runs3759OjPCk+9kd8ZQyiKnlomSb2G+aIfl8hpiANg/wmKXZ035ktlJOqZUjRPyVF3fhF+MTffCnPby/BiHlHo9HT0cnD4959TW33J+b9+H88Y4xadcyEbYhR/Wy4iVHBoBMKmZt9Xd30It0ESXFTko5UAWnufYyqZ1LIRb2vziqsCGn6V0brtm5QziR18fuGedhj/JJfZbWRLzz3W+5m1pK5ec55XfohemL8A/st402Sv+D7mDRxUjDcf7NIr13r7xTvKYOVqKqTmnrbRdqDX93gJPhR/P8n0MLZJy8ekjwwR8SEfsFUyA9jJoyK669vB36NBECz5H/PY7+NUPEfHxkHMccEY8bHR7+tmR1qGJ8ZsQITowoxAQp96j/kgQlxQnUToqqpX2qTgpqpYoTvw6hgnJW1ZGaSZMim+YqJ55p78BOMnrtpmRS7f0AZb5KkEWE0Ep4PVaQhIcHnUPhsom78Zk+j/YgVXpmLqWvMkL7kqJnfmPlsLhvWSlnNZ5ZMkXSJ21Vc5zehf3OWd7hHJQ3vzJd/SKinjPBT4b9NEf/WLw38On4yuomKiOn31BQvj2SuX2aV39cMKg5JRQqaC5iDXyV+gFHN+BViHlMEinpofHza+ncnlV9kAFeGBlQZWI9g1m3Zll+UMJ/3aP+6KHleEd4kNOENg3PCGz6KNLwUeBe6qmyas4X86er//u//9X+Yd6oGVta9DGVg9f55GTBlA67mMo3hl5Ee037z+CjNLPnxbV5DNu2N9endv/vHmqk/10yNimiYo7qPAsNhz/hwX2Hm3ZNUzPBxwTAgUctcvbswdvUfF6oojAnz7kx7MKj2RZhH55d4wzgnEfPr6W/AzHkp+55lX5cSQ+YcEsMGM6igVmWGw4Icz0n1jR8e/D0/ITgN6xhhfC7Qf/QbgmfopLl7iPaEKZMSUe8d1GRfhej7bywPfmEWqHmRZJmVdD1YAdOagbl8v5I+vfv3kCp+uKl7WH68ueEm02t+PLq+/L3BfoPq5iZHjT+M/Ma/eaQ1TKL/oGfM6hrlVD+0TCj8HF0PFHuzeWokPl29++37vcWX4bvfnjHz5YqSu6uSomHI/sx4gY7P6PY2vzJR09cTl5z1OE399N1vL47+ct2TNC9aeLXhevD4P2rkGjXDJ1LvXpD517D2RTnnfi+gCnqyekMYYwnOyjDQjmbt6iUu+rBN1wxeOU3vsy+aLpryhueh4cHHe8T8T+ovj0NJxLz77We97Bfmr0z6mRlWzNW12e8zmyopdlfMn87SPW9b7y8H31/a1uu0JsXgcftbK6/+RmLMX5le41XODB/+VgYG32utLz81YoZDf9+QfyXgSKjEpKWwyVB77lNo6ZI8JCGNAGfwnBc9LyOZ+ez5uutB4NdoMmKGETNk/vjHPzLvfnv1O4UvzJ+Yd789vzb48qy7e3XKU5H6kzNevCD73RMuhH52Toba/w8fQEVUkqRoztnst7euPL58x22+e+P0U195caf00jmeT139aPUZ/U8KfUN3VDlUd8/85DuH/7OAfiCL5r1paQatZ24idLgpDjniCm5gWjNLPl9Y/bBpeZVs9uVXjNQNqfwd+ppc9uXjGK2Ini54BskD82/MrkIlxcLjmV+Ym7IitNbYF039h77GHTzr0WTRZJK6b8JaWqwWKKQ15ENS1X39Scswa6XKBpMUzG/s9bXAsl/+wERk8NhjNbQOeyb80xn0X1Ah/3zl+JCcf3eIESoZbsAwESnQYPC1UUoemK1ivuwPGR9XyI9aJvejvmfvZTw91PdJ8UB+dGyePdTXp4f6xfygZ6E/T/Wz7zSmVBDEREmFwoZ2/bT/T+o6KfpLkzyLkooZvtTtmdwsimjO60u6h7rxgz6c9QqnO8+WfffbM16+vLQQZTVCD/4eNzXDMuwV81emQYgZ+s+IUh4oyZdC9QwYiMLRlDdJsT+dO47TuQusEEUKCknBDI3DU9N83kax9EzbJap6eUnRbw1jcqS7mPvXmvr4zch3lPL8bqavhi6ITWrmWCUNLXEHDNOQfRi/2H1zXVbkkFA2kmJ3H1JoUEH6GPDThQ/JP008+Fuqp6/ejsmOtkXUyanle7MfeiBe/vT3tzQG95FljzHzxz8ysqYM/nw+qL5Oyb4qfBz9ZdC0JWI+MVePI1cDdArxPkL3+yJp+jvTqwvVGlWHJERXfxkM/lwnRVZfk33zlYJ/rO975o9+E8b3mOzqq0FSlPvmcvP6dATzl8FjOqIb3/321kX4l6vBriL78r4vfz8xV99+Y3HpE68GdVMhP39rZX9deTVAF6tehyRCYS9/TYqrAVXS4Aft1VkL/6KY+Rq5zka8VE2zKN3XzdfZhjC4vzmj2cJnClLQJryI/OpyKdv7aFIzuL+CTTKEW7opQINfmDr0iwJFfUQrKxKg6HrwC2NpkvbykqpAdNH5ipgGnSoJzxcyl3vXAjVHUmUMRgeEaedek5zS7wHzn0ywb5gjoinh9w0T+wfEJA1TJbu4YQpyvB48Rd/eMc7GjC5/v0mmQ79MrmsSZqi5jm6++tPftY0cUFUlEboOSfHwXb8z+6V/GWx65Zo9TD+9fJp+eD/p8fcVfudL92GFMPGjcweKSr/6Nh/9nioyJw1izt9kPFm5t8WZz/r6GeXcr7MnKuc9/8U9OviPHOBx/fmoy7aLFn625zuK+8aThsPfDf5fAAAA//+KHcbJgUEAAA==" -> "H4sIAAAAAAAA/9R76W7bTLrmfwF9Dzz+Muhz8B3ZXCQlSncaRxRJLRaL5lYU2dMwuJTFpchiSGohv86NzJ/5O5c3lzAoSnZsJ3G6GweY7gCCw1reepfn3UrUnBQNKpqh1ZboI5PvcZOUftXc5MkJRX9gArIvIr9qP12pK1UWNRtIM8O9GtCnIURVnZDiI8Nds78b/G4wHD5f9LvBI20pqUtSJ02/1m8aP4xzVDR/YB4SjAo/R5+ukiJprsOH3dXXXVblF/UDqoZyEZIoKXYfmfdB0jxb0LPcoFNzE2Kyj4YhKR6S3e8GapKjb5j75fmawWBfo6r+OGCYIUM5+MigkB/SwQHDMExdx/f+volJlXQous9Q26+l/4bMVV3Hw6r2mdlsNhMF0Plzrg15mT5KM30mzmaz+Uyfn9IHZbXCi4d5MU1CvGxzp5LFyrJ5vJk0mbmwOFS+j+Z33ZFL3YlTxDq+26oluqsScAJbvPgQOtr0xlBKMWK7qXIE7a/Zwy6ePuxb4I6mq19Vf6K1FhR34xgQ5fRgbBfjZNmEN6aOi0BWktvSzEY4KclI9xqxyXezz7vMnE2kLm53wWQ/VqfJyVqdRo6Y7k2VXWz1DqQlemgTZ/9rvTJ+jXm70rPbmbjfr1w9qFL8qxLD3N8cqkNrafy+1ppD4YppHNwdW+0979ylfnkb3Uxjy/98J3NHpZ3YCl9sw9Hd7sjuEj2Y1EmgWN17YKGTI4z16YfPpa45qnsbljuvwqa/XN56pho3nfZejbxK2yj2lpjcDM3a0S5uQlBpooWDsXm4ey90HftZNBQ+nGsjjT2W4+Px8118OPJFEwiltblrItSsf4VjVr8rymLbmmbhlXynHEPEc8H2NHlfxFNcxJvK26XofUj04m6mnG5CLExkc93ukv1dKB5/zbgP7h676tb+7ItNdlxvMiOVytTa8misrrkJkd7X62U4unHGWfuwOURqDePoMzffLhcQamVHdgE7HUM3YY2tUhaeccMhuJvfGL86sG3cB/cDWz1ALYxmhF94D8V63LmGvV2vp6qX+cXpJMjvbS3J5DWY1nbKs2w3mbctu3pYfbaCNSeOH94/RIIfGtVmJIWuHSmrG05sgTNRuPR96CWzhba+BUG3VVhLaB4+nFjE6Z8+Mbmfkuq/KhTFfnMdkvzqJd5RxI/H3LTH/PyMeexJKw5Y8piOre5ELlXwqJwolpicltbkqGWT7YcivfHeI3IHdPlGZY+3ow/jW4YE+8hPXhw2OFZJg+5pRLi4Zek38UfmpsnLs3vf0xhxf/CruucsPEeBj8xfL4xqpmivNtL9XFPVlfXpgxD6Dx9YFo35MT8KRtzo4f3DOHgY+4iNhHDK8eGHKTflL7vnmnqnmbLxuP39wxgJkyiajj5wY/bBD0cBK0yESTiJhGkQvJ8gHn3goofXh8/u57JhfdqYbLMxublhR2srESUDrm3T9tY6q9hGP8c284xbm7YhQxlIuuNtPVYRTHsteiyGtgR0lXc7AMWFnY25gPdYlKtjS8p4YxHbAW+IEWsYjl1uAq5c+0svtTLFMOzjrY4VMWK9zwaEQM/wUrcUaNiKELGnRGXHpadEdciVEth6aeAAwVzEqZVxn/VtdAdlOLGg4SGbk6EFtv4CaNa2FKNjSedGL+YyZWvBtRGxsHBsw7GhIhuywka52pqpEkMhrqwFO0awnOgsEG0WC4aieGbWHJwMkygH2rzneT23bUX2+EixZUXu1zpTiT7rmQL0QqwcqLgmBKrbxRvHKYENcYEK0dBsIKrceqPm0cqQxJO7Vboo3d26cJ3CTOUBVsdeFp8M2z759gk68gdBldYGSmHn8yVRhfJkLfHSTmPBxu5hw4O16qxOYSpCBEvLZU++yoUChGWrHwkLJCN3BdJZWzwKFDCBHPRsTiz0DG/8RSRqS6UJcWmqzjR3HaNFS2ha86YLMk82nWakCmHldsqtB+FezUGtKlE5x5B1pPXS4DzJwBGweOXgZUblKFAyCrgxl9Gt7UQLa2l0pgx8xwF5hCPHVEofZKNRxEZHFSu+Y63GbhdzwVb8rMLZrS17tSOrI2+h+JbMxY6CE8MSgbk1HFUGK7MQBYPFR7fA+wBiO5g3nVFAPpCMA1xwLVqSA9rGk1A2eJhxd2GmrAO9HAV8LYQYNnAJM2MBFZtbzy0+ElW74VybM+ESxuZWNIJunQWCd7rtZicjdzvdHrXQBmLEQlF3FA3K3MLYRisbYnmOPVOVp3MdY8XIiOBZnqsK2dFbTOvQnN662CvdDJcRb+xtblaBjJtrciSqEGbmNjIcm5u7trIw0wgDvOuQJWYBf7z9wV7xca+xjRQ9mQq27QHd5ua6446+71enJ4zqu1I0ipIHPMYmG44DpdyE2aq1HM73ZeVkylhFzim2BOyEVigYHZ5bcG0bBTg6hc2qy5VgcIbgsgaJ8h1n2OBgKkoyz09VZIkusKeuxxq8swTzcDFdmMs1r8rNnemcLMDBW3XrHsGiPpgYF84yrIJFacOletC25TFIYxPmpyZc2geD5e4sy761nfXSnjean0I/7GBusN7Wl0eCZa0422mgJq1vg2WMzUyp7W280vmTZC/gyM4AcC1lDLYzAS7GhSaJGxNHLIKirukla/MR0IuZACA0PecDC2x7ZMtlaxazzl/iA1DWIw2uDYNvWuQA09xGuZ7FvC/EwMy9fcirgmNOeeBgzkjjBsncZJ4C1s3I+JYtx4atcOaSnNws4kIbuLeCcmtDw47mUyPo3DbKoq1rZ2Ob8zYuVkcujFW9W2ugUFLfWZ/C1B55qSGbmX5rFqC2zA9CuATjMFUOYGuwbrbeA5xx+ladzpNzTDbssbySgWJjY21kWNKhoZxjOXv7TaaggV7nYRstcO47II4W9mSezHaruSi7WyPWdmS3ms/OH8XDYQHKgB9NVpK6u5XEkZpkt0/zc9HytuvSdY47q4CNm8P2xf7zh1clMtIsMnI7clS7EgOrzEFXZqAjrCaVmduRk9oRzpNI51rk6KZkDPrnMvOsMvYscgIpOWlWmYAX/IHS48dxtIStZ4pisIgOYY5Zf8FOVktAXGvFARyV0SI2bVZRghy0aCuyvjPdn2U+f8wt6CIHtloiSlbKHUJ+zfnOKdvk09Y7vtBHHCxw5m+N8fP9/UceH6K5OPcc7xDm9mQll3GQzE4q/UikBRZptfmsVaXVaSVHAM5e60nUAkHf6Y7HetvVTkvEW9cZ7VRrRj8TNbUnarrbqemsU01xaUH9hR0iZ/3ZcwCrJSIOHKUMZCXzlmscCuo0EEASObj2FrANWbH1HIO4W33v8tPmuRy2ABM/h2k0F/XIWde+o+5MHo5XMt57+YfJNzIrIufmp9JtxY23zXa6cyoCYU313WiJ2Ib8j3X+jHfTZuWdvYRJsMDpxm4wssjuVlodgbTbuTlmb/VvMNV/LGeaRc6JCzty+735y+eoSmUO0jLzpDKlttCsMgYWTYxkrEmEU1PCgpTQJgJrVpmqKaE269T0LboiBimlS8a9fVPCelKZexYRVIt0bkd4Ny0TYJGOYt6zKH3CuVaZetab/I49yldPp0xci7RuRwTqK2pKeLpflciJ8n2hRX3r2PP9Nt3WkwgPOiKoUplSuh7VQVcmdAxIZe5SvVA50jJXJcK6KeFVi3Bv0xVz1+r54T2p91Oqi1ajZ6Sko/x5vX4of2VC+XSt3s9ZT3qTX0qLVa0yVzuaXMtcTcuM8knHgERaN6WxgcYIMnatElM703jyE7vFbkdpkE6zKM9l7nZ9bOKB1OsXuykZqV0vh+BaZ5t6aa/nt/hl+/jUUTyVWO3IyaP2OWPuSPn2UsJpZ722qtXHBM6zyBG8jV+BYtPtermOmkRpl7mb9jg7XWiMVYvatowpbijOPIrnN+mKWJUIf/GFkSeVMZBKDDoy8s66GXspxV+J3a6nxasUzymV6209nGN4iSnfVI/U3t7Zvyh/I3CJ80AiHEjJiMoA0l7/b9HtMaP2uiAnqg8vLWO1P6e3IUtldylm6Dhda5Ej9aWf0O31RfWpSRSfvXyCevbBI7WPJpERxbLaz/V46IBUxu7bdmM9i/ooadWU+kKPjZEm0ef+rF7XGsU1tSnVC/W7lJx+Yrdc63FKY1eZuB3FPeloDKI47nHXY+Ps473PULxRv3jbjxNw9vu250U62w+k5KhaZaz2sa3MqC+6aZ+zj9Q/VOln8WHWaVIfI0fUD1war6RzDaBJ1I49jo893izCaef8T2NU7L3pxzMa/xJw/H5uMLbxMeDHOCj0yUpyOWCpwmq+OyJJPqrS7PQipyg7TpUwr7YiRksDB33NM+6+rWVEF1izcZSqOz1XOpofdX66DwWjdR28j5bqZLUArb81SpdX6h/kO0m3yoVunyzjm7z2lf6zXNznVtOhfBmll2McpmT3fdozHkilaPTxuFwYVikbVjlXrVKmmDOkUqF5g47rVjnXzrlpTvEDKE8W4Y20VIy0FFWrlIy35N9C1l9MqazjldxgZIprbwH357qS1lKz79tu0WDk4ExLsaJlhqJl9lhLI1nL3FbL9JOWGaKWrjgtU+b9WArnWmrzWrritUwdaWk819KZoKWuoKX6SMu8hZatxR/oWva3a811OKwl07dru2efkIet7yi1loKFloadltGzooWWRoqWGgstlTktlTst9RQtk09a5s37df1avdUyT9Yye6SllF+7O6/Rj/M39NnXWQrsXCfCWiKmfR3rgDj4pk684HuBC39rxMFctHwn2rtbgwtzu77YgtZdZbiIcZhz1Ae+sYUj2Udt63YrGY6iBdx7C5hd9sKQVwrP+hHGRNtS1B3kYbJSAA4LD4eJKEZbg3jOmD33FPgQvCHrM2yLwdLAYT6me3jPFC+2+gF2ZEOzuzINeO4YCACHyfilPdvjzpDHllYAlupxk4NDsBUP1J6bfNq5BSyDhb4PhHWxmYuyhdWJu426t9ZdeqPnOn5d53b+Qm6B5W39rUFsDETDGadhgY/f6kGMtd7XyFilvVDa57G0r23ONRzNETQPnh7rSBp3ab1A83Rf91h9TflCPy6vTrTFauKl8gR0swng7YlnzSaeI0+83J6AxWqiWtlETbOJJ8kT17InnuRO3FyeqNJu4i3siWbpL+v7BcRauqP4bbV8HWu5l2qpmGvpbqylM+qXmZZmx/MamGv5OtNSd6TlMNZyu9VSuj581Q+KNAeNae7oez1aH9K8RWWSaK3U1zJ9/qZ1IjjXDmOP5guJtB6tR9O+vnkhv+aoEy/VJ8BSJ26nT1xr1+tCzd2J59gTtaNy2hOXtycafbbkiSbZE1UKJ24X9mNeOnspvzRjtTTOtFxltVzJtVxntVTmtVwfaemq01Ix03Kb1XL3pKWrkZaGvJbuOi2VWS11+X5fqp9e5ZAxrT09qe97af3Q9f2v1T/TupPm9BT0ObuMz/mb8LQ3dlNy9Giv0ZWJ9qqeUS17AlJ3olnqBFA99DJSuajd9QnoVhOXpzKvJsAKJ0CiWNlNXMuduL3eqPzuK/srqZYriZa64z6GpdlYS9e5lttHLZePWuqyWrqisnZauuO0XG611D5pqZFr6WzUz+cy99r+QCoT9VynnvpamT6nNPf3ehDU810Aq158gNZ4VF89LqS+rqR1zUv8W+FE7WYTlcrH2xPV0ScqxfaC9szhxE3diZfLvR5U6iuS3uMddBQ32QTkFCOrV/bf8VoapVqqJFpuYC0NWS1VsJarnZaqRy0FiZa7/DkPhK2WrlotpZhZcVoqplqKcb/3pf1pH0P9OFW7vh7iejxYvc+PQFdml36U6/tT6gNU7q5M+vq+H6M1+0v5qY97uTsBC33iSfoESGovm0r9ILcnbrqaqDkdl3vb03jhSbMeH8BaTTzre/4PYi0Nx2dMz46Pl016BpemPdrpLDShjBemDUQo2/3cRi+BaWMZOaWks0pr8pEYsXiuO9EaQrwObE685XadaomfXdY+qZInAcfIVEFmIRslzjaSbYhvTX7qm07Mu+xYtG2ozrO1oW+jhZ9BaNnrtcHKJ2hDMRIi1U2B5jvGNlgCX+8g7/JcGrExcdkx8DMoWNBQkM3Z+hZrUM5YyPdfHEyMbXhL5yL2+VwpBjZn2dto7XGv+HCauZHHzvMvChwc3yKsrMz85Bt8TDxZ5fwdxbMoeHyk+DYnqnIk2YKytFmcqKxhGPZatCEUdctY65kh6Nuo8Fi40Z3pWs8Uw5BWncsqx1CBlgNh5Vgr3mWxMc84zk3Xlc6V2oYfK9pCFuCWCD4uY1TMWicHSSCATJXLU8SuibstDz5bCnan7F2WO0RwJXjSrAphqWsyZH0F5gGX3bp47QV2A8K2+Wzz63nkgAPAhulkq5HaRWMViitVrnnAwyaydVZdKhMkT7dqF382uPUJpAYIHMgDc1pCh+3gFgJPLycuqyibTiGWjC2Yw7nKZSN1EX32k7ozoOeGsrcPYex72ajSC/HoWOsKWDoLnJEQFkBTs7o1F83BkuBna6voKFeO8zyWAxY6Aedtncw46pw4R7l3iJzVyOZiVuen0LDHtamUiWefKs8Btz47lcwtGJlLl1WXawU4yjoU7M63wS2QbDYowlug4ATZ7sFfKo21LAvLBmND3nWm3KwjBRfqYp1ELPbggtM8Nio2gqGBDohOEUG4wIbHKifTgrnHg9R2OAw5hY2OZatu5U53IqBnimjwZeGlseDxnhCxhth/+ZSKtg6V1YZdi+Y2Eg1ZyfQ80mAWG0CGC49ToJPVrGNOWVDsjkEKDnMcs6EFAWDl0y3PHqJ8mmrLCNoQyxCvjn62VgIhskxbgUGhC+HCyy1l1fowarXFiYVs2fn2aa7mxnrTRSdfjk42zG4te+0h2ZN1COYeO3b0TAGWrbbatvQC7B3dLDIiZ9WZ+bjwFfngttNsw3uVpniKmnrktgMaSkVe5ad3RjYlqmyI1rHsaZmKPNIzJddkONdtTtJzRYxYKFx0UOuZIkQsKBwbbyIOz3WsQFNWBGMbOY9y2dlaAcvINm0M5zhrta2RGh2eODheU76sHGeQP3VOpnJRDhrPBssgGx0dGGWBfGqswkscec273dpB9qn5Vq7RrcfHxF/onbWFnppi1mXDMcKla27hd7+EfP3FoA4VxZLXhm4b1Kfnut0Uql5WEYtTVHiKWeit7cAUyrpg8spK3Ropso8jR15VQJ62txwY+cLs6MJ4GznRZ8853YEMw7BYjQzJqHQu9nUWu6BTDvPU48wCpJEcpYZidJrdtFAeuz7bHNESnzwJSpqDs3BJjtCKraCLrY0AgQ3juyCPl0a2GnmOPdIh0JBcH6DtsR5Pbo0FtJHcrFzbWBj8WrFhOdEg2ESd3vp82QY2l0BBKc283EZtY0f22gmcurVzuABbAF0BnHTOPVqScQzx2tG2yjjclTHMpr41bySPKyU7L4lrlyZcRsQXxMwWypOdG0YozATXASMrU1ZB0rBw0YjWEp9cIRKD1MhMPmSDwuDDJdZNCOA8Vw/BEoKAIyOjyzhVjjtrG91tOGy7PF4bdmkgBy7VziNRZ8zddtrY7K41stKxc+AYS7CFmRd7aXiAC8M0FmDkJ/VtyGcnHSsdwkqj2qc6kLkjcCJBt9jby5fkipXpP8iB5NPrL11Mc3N/K7vm/cwAn/yq+Ogf6481CivU1Llf+DtUfdzXQ+TXzZD7OBWE92Oem76fTqeXVR+TokFV4eP7kOQlqVHVv94zrMmhGmWX40xbNOfG6s5aaeBenYHZ4vJmwAxI//jJ9T6owyopm4QUw8uWYUjy3C+iYaa7mEwfz3dNS1bvl5ppgZkq398ZsrLafqobf5cUu+GjCMNHEV5rSVoZn25QE96QOtgnOHq90JTnhmyZT6LJQLrTVsC6t43Np7hpyvrjzc2hDNGQjTiBG48EdjIeTQMujIbT7lS978aH65eyXz/Jfk03Xvu535HCP9bXIclvHhncaLbkzKz58n6jLcy3zuUQK3CBP2YFwQ/YcDxEnw87cjrw15js6p+e9vT+yPe08M3AdUNy/P3XSv6ckTT5y+XBx5gcUXQfkdxPipr5xPyZuWqQn19fKF6Tanf1n8xVvA+ugwodX48fSZWh6tsp5vGE0Gc+MVff5zr0h2HVXJcovxo8cncm+Hfz99/GxytN56RImir8vip/YVQ6zZzfwdtXPnUE5oFUzCr3d4gR6TGoYpKCmTnm9dMuiYT1R+YRHnl/Rm/n/n83EQn3OSqantx57Dpucjx4IjCPUZgx6ICqlhFYpkYhKaKa8YuIwWTHNISp2xqT3eORNWqYyEc5KRiBfTZGF59XfqU9oypn/DBEdc0cEp+p65hp9kWBcE8YIaaJEZM/Sl4TjJ6fQ8WKmJJUDcN/4HjK1GWW/tvXiPGjqKLEMQl9HJO6eTbvn0+P8qT42B/xlTGIquShZZrYb5gj+n2FmII0DPKbpNjRfWe2UE6qliFF/5QUdeMX4RN/86U8v70EI+YdjUZPRycPj3v3NbXdn5j34//xjDFq1TETtiFG9bPhJkYFg04oZG72dXXTi3QTJMVNSTpSBaS59zGqnkkhF/W+OquwIqTpXxmt27pBOZPUxe8b5mGP8Ut+ldVGvvDcb7mbWUvm5jnndemH6InxD+y3jDdJ/oLvY9LEScFw/80ivXatv1O8pwxWoqpOauptF2kPfnWDk+BH8f+fQAtnn7x4SPLAHBET+gVTIT+MmTAqrr++Hfg1EgDNkv89j/02QsV/fGQcxBwTjBkfH/22ZnaoYXxmxApMjCrEBCj0qf+QBybECdVNiKqmfqlNCmqmihG+D6OCcVbWkplJkiGb5ismnmvuwU8weu6mZVLs/gFlvEmSRoTRSHg+VJGGhASfQ+Gzibrxmz2N9iNWeGUupq4xQ/qSo2Z+Y+azuWxYK2U1n1kyRdIlbldxnd+E/s1Z3uEelTS8M1/+IaGeMsJPhf82RfxbvzTw6/jJ6CYqIqbfU1O8PJK5fplVfl8zqDgkFSloLmAOfpX4AUY141eIeUwRKOqh8fFp69+dVH6RAVwZGlBlYD2CWbdlW35Rwnzeo/3rouR5RXiT0IQ3DM4Jb/go0vBS4F3oqrJpzhbyp6v/+7//1/9h3qkaWFn3MpSB1fvnZcCUDbiayzSGX0Z6TPvN46M0s+THt3kN2bQ31qd3/+4fa6b+XDM1KqJhjuo+CgyHPePDfYWZd09SMcPHBcOARC1z9e7C2NV/XKiiMCbMuzPtwaDaF2EenV/iDeOcRMyvp78BM+el7HuWfV1KDJlzSAwbzKCCWpUZDgtyPCfVN3548Pf8hOA0rGOE8blA/9FvCJ6hk+buIdoTpkxKRL13UJN9FaLvv7E8+IVZoOZFkmVW0vVgBUxrBuby/Ur69O7fQ6r44abuYfnx5oabTK/58ej68vcG+w2qm5scNf4w8hv/5pHWMIn+g54xq2uUU/3QMqHwc3Q9UOzN5qmR+HT17rfv9xZfhu9+e8bMlytK7q5KioYh+zPjBTo+o9vb/MpETV9PXHLW4zT103e/vTj6y3VP0rxo4dWG68Hj/6iRa9QMn0i9e0HmX8PaF+Wc+72AKujJ6g1hjCU4K8NAO5q1q5e46MM2XTN45TS9z75oumjKG56Hhgcf7xHzP6m/DFERlSQpmrMn//ZWu/flsuVCJYno+p+0v1+YvzLpZ2ZYMVfXZr/PbKqk2F0xfzor5Hmne3/h9f7S6V6nNSkGj9vfWnn1NxJj/sr0RqpyZvjwtzIw+F43fvl1EjMc+vuG/CthTUIlJi1FWobac2tDq53kIQlp0Djj7bzoeeXJzGfP110PAr9GkxEzjJgh88c//pF599urnzZ8Yf7EvPvt+U3Dl2cN4atTnuran5zx4p3a755wIfSzczLU/v9zm+9eUv3UV15cQ710judTVz9afUb/k0Lf0B1VDtXdMz/5zuH/LKAfyKJ5b1qaQUugmwgdbopDjriCG5jWzJLPd1w/7HNe5ad9+RUjdUMqf4e+5qN9+ThGi6inO6FB8sD8G7OrUEmx8HjmF+amrAgtT/ZFU/+hL4sHz9o6WTSZpO77tpbWtwUKadn5kFR1X7LSys1aqbLBJAXzG3t9LbDslz8wERk8tmUNLd2eCf90Bv0XVMg/31I+JOefKmKESoYbMExECjQYfO2tkgdmq5gvW0rGxxXyo5bJ/ahv83sZTw/1fVI8kB8dm2cP9fXpoX4xP+hZ6M9T/ew7vSwVBDFRUqGwIVXbXxkkdZ0U/T1LnkVJxQxf6vZMbhZFNE32VeBD3fhBH856hdOdZ8u+++0ZL19eWoiyGqEHf4+bmmEZ9or5K9MgxAz9Z0QpD5TkS6F6BgxE4WjKm6TYn85NyuncOFaIIgWFpGCGxuGpzz5vo1h6pu0SVb28pOi3hjE50l3M/WtNffxm5DtKeX6d0xdQF8QmNXOskoZWxQOGacg+jF/svrkuK3JIKBtJsbsPKTSoIH0M+OnCh+SfJh78LQXXV2/HZEc7Kerk1PK92Q89EC9/+itfGoP7yLLHmPnjHxlZUwZ/Ph9UX6dkXxU+jv4yaNoSMZ+Yq8eRqwE6hXgfoft9kTT9NevVhWqNqkMSoqu/DAZ/rpMiq6/JvvlKwT/W9z3zR78J43tMdvXVICnKfXO5rH06gvnL4DEd0Y3vfnvr7vzL1WBXkX1531fMn5irb7/kuLSWV4O6qZCfv7Wyv+G8GqCLVa9DEqGwl78mxdWAKmnwg47srIV/Ucx8jVxnI16qplmU7uvm62xDGNxfttFs4TMFKWjfXkR+dbnH7X00qRnc39omGcIt3RSgwS9MHfpFgaI+opUVCVB0PfiFsTRJe3mvVSC66HyrTINOlYTnO5zLVW2BmiOpMgajA8K02a9JTun3gPlPJtg3zBHRlPD7hon9A2KShqmSXdwwBTleD56ib+8YZ2NGl7/fJNOhXybXNQkz1FxHN1/96e/aRg6oqpIIXYekePiu35n90r8MNr1yzR6mn14+TT+8n/T4+wq/8z39sEKY+NG5aUWlX32bj35PFZmTBjHnLz+erNzb4sxnff2Mcu7X2ROV857/4h4d/EcO8Lj+fNRl20ULP9vzHcV940nD4e8G/y8AAP//A7JFD7RBAAA=" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0d2a793b56ddc46e8" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 4 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ image_id                = "ami-07bb20d82c4e502f6" -> "ami-0a54ea24893e357ca"
      ~ latest_version          = 4 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWvxVYGrNutVjrvQ2FNtLGnPuj55HkuO/tzR1CeYxY9wlz/mGGWY5hGM4Rpnj0XOYJhThntsC0KrwXPtVrvdvlA9uhnenXpVpiWbGJOLfN0U9a42nBnDqfqsdNRO/1LmOmrvzyvLCzdHWZCWXT1zYWFQEkUw9phw7pCkfdXv6IaknMKldhTpeaZJ8nDxlFO4DuI1g/cUZzEkzC7Jwkv/fRO43lB7qmGKapfgMtdoX6VLXU0y9FfHJLU3mw5V49nUJk8+pWn+WKu99az66lkVRvCYxJdDrN32HV9T+cVClSYR+Xo78q8w2QT/cfmAhCQ77D17SQSDOAdP4F/gjmIY3ULm7t/AnV+41fIY36+fY/PlFrhqQBA8gbuvW40ggzJaTXHZZ12sOwv8w/b9ZXa8i3SUxAHN0NdD+S1Qym1wnt2KDJaYA6skA8MIrjEQSzU4A0EMOrZefeXqJSh/BFcMRCcdp3M+/ap5CSrKOfQk7rxW9WlEKq8Cuj5GIcBbnB2AwIIcoyT2cgBjD5BkDWgC8kNOkvVVZY4p8CCOkhgI7M1aSXym/Cy7U4YcQIRwnoNtAMuZE9AijjE5CcYYUB+D6Op5nhB8q6d0ywNpklHAP3B8adRlt/wrcgyg52WlcJIgSPwkpzf78Kzdi4L48aTis2EWzoLVAVAfUrDD32UYxAkFGNIgXpd8Z7NwlGQHkMSnryDOKYzRq33dgdQdX+49uC8v/qvqYHXlLfLy7H4Crcb/vzGsPNUGQAdEcH6zTH0cA7zHCNSKPKudXKq5QVxLk2OSuQl9hgRnN15IcV5k5xBmSUJPTw35Iac4AkEef0fBqiDkrb3ycCJdbD6xzDrGANRuLc9TiPCr4Q/sl4bTIHpj9y6gfhAD7q9w6YzGCzaCFdhhgGAMMgyRD5AXVz/PU5/vgDo1pO8jHx48HP/wCGwMdgEhAJIdPORgjSmAoM4KwMcZBi5GsEROsgKIBDimAOGM5m/DVB4nyHxMnpEXA3toDMCluL0z4jZyKxgQfAvQNIjXfyIYvyqyvAv1unC7lCU0QQk5J4GbjZxCWpR5rs4K744L5DkByamu5eAj6HbKgW4oD7sdQyohcslYmZ9HNQRrZ3+ZAqdlYgOf/pRTr7nwN53/Mjn+vxOpC3P/9dB1HHvgxJOXeLmKqb7Np9/lAMfbIEviMguCLcwC6BKcA5hhcE2O2DtB4/GV9Q+n028l1RpqU1WRVOMK5rkpmdKbCv1S4AK/K8e3bUctKFM9455TPXN1ibl0ERe5iqTrnb70dPc///Wf/w3ulak6NJ7LAds43c/Lgi5p1rArldnrsnLCNKTXz17HkK7vH5qkmxPj6f57uMtB/pKDHMceE+H8lAUY5mQ4U2QE3L96BZgrAeMm3gHc3V8Mu/vhIhUjPwH3Z9mVSlbEKPLOzx7IjxIPfNj/DsycSdkWy74vogw45zpECcBxeaqAYeJkdy4nv/JU+0ceXfdM7mNCzl3gL7263qCzrFoMLhKQBikub28lT4oM4a+/8VS+BX1M35QXMOxVK0NVNzpqV3oe9p7uv0dl4JlJfoLlY63GNdtVvlGvXv6tEUhxTmsRppDxIIW1qywm8H4odXTyHEdlfMoCGcMIVyuyOZm8dqtPd/cfv97AfmLuP94Y8+muFDfLgpiCpDgbHuPdjdzTmd/pmJ4q6aUYXbfLe3r/8Y3qT9WTSP0ShXcM1cr1V3nIOabMq6j7N2L+Hqd9Cc55qHDLAL2eOk2ANlDPwdDwOsgpzt7i4pS2S5rKu0tzurNvev+y5DHnJWYLSYHBv5f35boUeOD+428NTJ/Az2DzApgM3FX1E59OsyBe34Gfzt7dzkbPF8XPl9mousmTuHJl/zXKu98pDPwMThHPIsCsfq8Bla/Nb5f/nAEMAwua/J2A08MpSQ6gHH5Pmf48p+Rn0Fw2S8hcZxHQ7Zx6m2AVIEhxteLCHDfrgPEAA3788Udw//Hdk+4n8BO4/3g7ln66GWh+SU2ID6dx4Y2uvwSkX3k1+E1cnqNyeiJ4C8PPG3dfpzxj7DVCX4bizMCE+HAKxzvBKKP/R8HXON+A/Atv/n54PZXtMm9/BbVl3i/SG5LKt8CY9qZvu/kYY6/MkCiJtzgrK0Vw6vl6qg7K4peBXdmF7jAgsIiRX60gSE8Iv7uJ9KWB/3Qb/bJ+fLoDP/10a8LfKMTXQlukl7iCHGfbAOFLfGcZTstO9/0zxXc5yHCUUPye7XSR8wSFuByJfqHBuko7i7i8af3zfVgfH1os+0UwGeabyv8GAAD//6S7krOQHwAA" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 4 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ image_id                = "ami-07bb20d82c4e502f6" -> "ami-0a54ea24893e357ca"
      ~ latest_version          = 4 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWOrAlvlHqocdyGxp9pY0p51ffI8lhz9uaOpTzCLH+Euf8wxyjDNIxjDNc4ei5zBMKcM99gWhFaD59qtdrt9oXp0M7w7tapMSzYxJhf5uinqXW04M4ZT9VnpqJ3+pcp11N6fV5YXbo6yIC2beubCwqAkimDsMeHcIUn7qt/RDUk5RUvtKNLzTJPk4eIpp3AdxGsmiCnOYkiYXZKFl/b7Jm69ofZUwxTVLrFlrsG+Spe6mmTor45Jam82HarGs6lNnnxK0/yxVtumCDOsxwlcoy6wzUa97XLIY9rHfdY6NrbVt55XXz2vloxVGMFjEl8Ounbbm3zNri8WqjSJyNdbln+FySb4j8sHJCTZYe/ZSyIYxDl4Av8CdxTD6BZWd/8G7vzCrZZn/X79HMAvt8BVA4LgCdx93WoEGZTRaorLXuxi3VngH7bvL7PjXaSjJA5ohr4eym+BUm6D83xXZLAEJlglGRhGcI2BWKrBGQhi0LH16itXL0H5I7gCJTrpOJ3z6VfNS1BRzqoncee1qk8jUnkV0PUxCgHe4uwABBbkGCWxlwMYe4Aka0ATkB9ykqyvKnNMgQdxlMRAYG/WSuIz5WfZnTLkACKE8xxsA1jOpYAWcYzJSTDGgPoYRFfP84TgWz2lWx5Ik4wC/oHjS6Muu+VfkWMAPS8rhZMEQeInOb3Zh2ftXhTEjycVnw2zcBasDoD6kIId/i7DIE4owJAG8brkO5uFoyQ7gCQ+fQVxTmGMXu3rDqTu+JIcwH2ZHV5VB6srb5GXZ/cTaDX+/41h5ak2ADoggvObZerjGOA9RqBW5Fnt5FLNDeJamhyTzE3oMyQ4u/FCivMiO4cwSxJ6eo7IDznFEQjy+DsKVgUhb+2VhxPpYvOJZdYxBqB2a3meQoRfDX9gvzScBtEbu3cB9YMYcH+FS2c0XrARrMAOAwRjkGGIfIC8uPp55vp8B9SpIX0f+fDg4fiHR2BjsAsIAZDs4CEHa0wBBHVWAD7OMHAxgiVykhVAJMAxBQhnNH8bpvI4QeZj8oy8GNhDYwAuBfCdEbeRW8GA4FuApkG8/hPB+FWR5V2o14XbpSyhCUrIOQncbOQU0qLMc3VWeHdcIM8JSE7FLwcfQbdTDn1DedjtGFIJkUvGyvw8qiFYO/vLFDgtExv49Keces2Fv+n8l8nx/51IXZj7r4eu49gDJ568xMtVTPVtPv0uBzjeBlkSl1kQbGEWQJfgHMAMg2tyxN4JGo+vrH84nX4rqdZQm6qKpBpXMM9NyZTelPGXAhfvy/Ftb1ILylTPuOdUz1xdYi6txkWuIul6py893f3Pf/3nf4N7ZaoOjedyCDdO9/OyoEuaNexKZfa6rJwwDen1s9cxpOsbiSbp5sR4uv8e7nKQv+Qgx7HHRDg/ZQGGORnOFBkB969eAeZKwLiJdwB39xfD7n64SMXIT8D9WXalkhUxirzz0wjyo8QDH/a/AzNnUrbFsu+LKAPOuQ5RAnBcnipgmDjZncvJrzzn/pGH2T2T+5iQc6v4Sy+zN+gsqxaDiwSkQYrL21vJkyJD+OvvQJVvQR/TN+UFDHvVylDVjY7alZ6Hvaf771EZeGaSn2D5WKtxzXaVb9Srl39rBFKc01qEKWQ8SGHtKosJvB9KHZ08x1EZn7JAxjDC1YpsTiavLe3T3f3Hr3e5n5j7jzfGfLorxc2yIKYgKc6Gx3h3I/d05nc6pqdKeilG1+3ynt5/fKP6U/UkUr9E4R1DtXL9VR5yjinzKur+jZi/x2lfgnOePNwyQK+nThOgDdRzMDS8DnKKs7e4OKXtkqby7tKc7uybAaAsecx5idlCUmDw7+V9uS4FHrj/+FtT1SfwM9i8ACYDd1X9xKfTLIjXd+Cns3e3A9TzRfHzZYCqbvIkrlzZf43y7ncKAz+DU8SzCDCr32tA5WtD3uU/cADDwIImfyfg9HBKkgMoJ+RTpj/PKfkZNJfNEjLXWQR0O6feJlgFCFJcrbgwx806YDzAgB9//BHcf3z37PsJ/ATuP97Orp9uBppfUhPiw2lceKPrLwHpV54WfhOX56ic3hHewvDzxt3XKc8Ye43Ql6E4MzAhPpzC8U4wyuj/UfA1zjcg/8Kbvx9eT2W7zNtfQW2Z94v0hqTyLTCmvenbbj7G2CszJEriLc7KShGcer6eqoOy+GVgV3ahOwwILGLkVysI0hPC724ifWngP91Gv6wfn+7ATz/dmvA3CvG10BbpJa4gx9k2QPgS31mG07LTff9M8V0OMhwlFL9nO13kPEEhLkeiX2iwrtLOIi4PX/98H9bHhxbLfhFMhvmm8r8BAAD//5B24/20HwAA" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210127204046067100000002" -> (known after apply)
      ~ id                                  = "sfr-46db2e27-653b-4606-90ac-ddad26e7ea48" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "4" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210127204016366800000001" -> (known after apply)
      ~ id                                  = "sfr-1243d11f-144f-4088-a5ac-031c2d17c69c" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "4" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-2123328067" -> (known after apply)
      ~ instance_id = "i-067b892a2faf55162" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-2894777164" -> (known after apply)
      ~ instance_id = "i-09f1422c7fb304621" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

Changes to Outputs:
  ~ rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-20210119095147 (ami-07bb20d82c4e502f6)" -> "RHEL 8 pre-built: imagebuilder-service-image-20210127220723 (ami-0a54ea24893e357ca)"
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*